[
    "Whenever a player casts a white spell, you may gain 1 life.",
    "{X}, {T}: Search your library for a creature card with mana value X or less, reveal it, put it into your hand, then shuffle.",
    "Each creature gets +1/+1 for each other creature on the battlefield that shares at least one creature type with it. ",
    "Each creature gets +1/+1 for each other creature on the battlefield that shares at least one creature type with it. ",
    "You may play lands from your graveyard.",
    "Whenever a player casts a black spell, you may gain 1 life.",
    "{3}, {T}: Double the amount of each type of unspent mana you have.",
    "Whenever a player casts a red spell, you may gain 1 life.",
    "{2}, {T}: You gain 1 life.",
    "{5}, {T}: Create a 1/1 colorless Insect artifact creature token with flying named Wasp. ",
    "{5}, {T}: Create a 1/1 colorless Insect artifact creature token with flying named Wasp. ",
    "{1}, {T}: Tap target artifact, creature, or land.",
    "{4}, {T}: Draw a card.",
    "Whenever a player casts a blue spell, you may gain 1 life.",
    "{2}, {T}: Target player mills two cards.",
    "{2}, {T}, Sacrifice a creature: Draw a card.",
    "You have no maximum hand size.",
    "Whenever a player casts a green spell, you may gain 1 life.",
    "{1}, {T}: Return target creature you control and each Aura attached to it to their owners' hands. Activate only during your turn.",
    "{T}, Pay 2 life, Discard a card, Sacrifice a creature: Create a 5/5 black Demon creature token with flying. Activate only as a sorcery.",
    "Creature cards in graveyards and libraries can't enter the battlefield.\nPlayers can't cast spells from graveyards or libraries.",
    "{1}, {T}: Untap another target artifact.\n{3}, {T}: Target creature can't be blocked this turn.",
    "You may look at the top card of your library any time.\nYou may cast artifact spells and colorless spells from the top of your library.\n{T}, Pay 1 life: Exile the top card of your library.",
    "{4}, {T}: Draw a card.",
    "You have hexproof. \nIf a creature would deal damage to you, prevent 1 of that damage.",
    "Attacking creatures you control get +1/+0.",
    "Tap two untapped artifacts you control: Untap target artifact.",
    "You may play lands from your graveyard.",
    "{3}, {T}: Double the amount of each type of unspent mana you have.",
    "At the beginning of your upkeep, choose one —\n• Put a +1/+1 counter on target artifact creature.\n• Put a charge counter on target noncreature artifact.",
    "Players skip their upkeep steps.",
    "You may pay {W}{U}{B}{R}{G} rather than pay the mana cost for spells you cast.",
    "If a player would draw a card, that player skips that draw instead.\nAt the beginning of each end step, each player sacrifices a permanent unless they discard a card.",
    "{T}: Tap target artifact.",
    "You may cast spells as though they had flash.",
    "Nonartifact spells you cast have improvise. ",
    "At the beginning of your upkeep, scry 1.\nWhenever you cast a creature spell, you may pay {G}. If you do, draw a card.",
    "{2}, {T}: Tap target artifact or creature.",
    "{X}, {T}: The next time you would draw a card this turn, instead look at the top X cards of your library, put all but one of them on the bottom of your library in a random order, then draw a card. X can't be 0.",
    "{2}, {T}: Untap target attacking creature you control. Prevent all combat damage that would be dealt to and dealt by that creature this turn.",
    "{2}, {T}: Target creature gains flying until end of turn.",
    "{2}, {T}, Discard the last card you drew this turn: Draw a card.",
    "{3}, {T}: Untap target creature.",
    "{2}: Choose one —\n• Destroy target Aura attached to a land.\n• The next time target land would be destroyed this turn, remove all damage marked on it instead.",
    "{2}, {T}: Prevent the next 1 damage that would be dealt to any target this turn.",
    "{X}, {T}: Untap X target lands.",
    "{3}, Discard a card at random: Target creature gets +2/+2 until end of turn.",
    "At the beginning of your upkeep, you gain X life, where X is the number of cards in your hand minus 4.",
    "{2}, {T}: Draw a card, then discard a card.",
    "Attacking creatures get +1/+0.",
    "{2}, {T}: Target player mills two cards.",
    "{6}, {T}: Return target permanent you both own and control to your hand.",
    "{3}, {T}: Target creature gets -2/-0 until end of turn.",
    "Whenever an artifact you control is put into a graveyard from the battlefield, you may pay {1}. If you do, you gain 1 life.",
    "{2}, {T}: Target creature with power 2 or less can't be blocked this turn.",
    "Whenever a player casts an artifact spell, you may pay {1}. If you do, you gain 1 life.",
    "Whenever an artifact you control is put into a graveyard from the battlefield, if it wasn't sacrificed, you may pay {3}. If you do, draw a card.",
    "Attacking creatures get -1/-0.",
    "{5}, {T}: Prevent all damage that would be dealt to you this turn by attacking creatures without flying.",
    "{2}, {T}: Target permanent you control becomes the color of your choice. ",
    "{2}, {T}: Prevent all combat damage that would be dealt by target creature this turn.",
    "{2}, {T}: Prevent all damage that would be dealt this turn by target creature you control. That creature gets +0/+X until end of turn, where X is its mana value.",
    "Sacrifice a creature: You gain life equal to the sacrificed creature's toughness. Activate only during your upkeep.",
    "{4}, {T}: Put a matrix counter on target creature and that creature gains \"Remove a matrix counter from this creature: Regenerate this creature.\" Activate only during your upkeep.",
    "Instant and enchantment spells you cast cost {2} less to cast.",
    "{4}, {T}: For one spell this turn, you may spend mana as though it were mana of any type to pay that spell's mana cost. ",
    "{3}, {T}: The next time a source of your choice would deal damage to you this turn, that damage is dealt to target creature of an opponent's choice instead.",
    "Creature spells you cast cost {2} less to cast.",
    "{T}: Tap target artifact.",
    "{3}, {T}: Counter target instant or Aura spell that targets a permanent you control.",
    "{4}, {T}: Create a 1/1 colorless Snake artifact creature token. It has \"Whenever this creature deals damage to a player, that player gets a poison counter.\" ",
    "{3}: Target creature doesn't untap during its controller's next untap step.",
    "{2}, {T}: All creatures get -1/-0 until end of turn.",
    "{2}, Pay 2 life: Draw a card.",
    "{T}: Add one mana of any color that a land an opponent controls could produce.",
    "{2}, {T}: You gain 1 life.",
    "{2}, {T}: You gain 1 life.",
    "{X}, {T}: Change the target of target spell with a single target if that target is you. The new target must be a player. X is twice the mana value of that spell.",
    "{5}, {T}: Return target enchantment card from your graveyard to your hand.",
    "{1}, {T}, Pay 1 life: Add one mana of any color.",
    "Spells you cast cost {1} less to cast.",
    "{T}: Target creature can't be blocked by Walls this turn.",
    "{3}, {T}: Target player reveals a card at random from their hand. If it's a land card, that player discards it unless they pay 1 life. If it isn't a land card, the player discards it unless they pay life equal to its mana value. Activate only during your turn.",
    "{2}, {T}, Discard a card at random: Regenerate target creature.",
    "{5}, {T}: Discard a card at random, then draw two cards.",
    "{1}, {T}: Target 1/1 creature gets +1/+2 until end of turn.",
    "{2}, {T}: Target creature gains vigilance until end of turn. Activate only during combat and only if defending player controls a snow land.",
    "{2}, {T}: Target snow land is no longer snow.\n{2}, {T}: Target nonsnow basic land becomes snow.",
    "{2}: Target creature gains banding until end of turn. ",
    "{3}, {T}: Target creature you control gets +3/+3 until end of turn. Its controller sacrifices it at the beginning of the next end step.",
    "{4}, {T}: Attach target Aura attached to a creature to another creature.",
    "{T}: Destroy target permanent you own. It can't be regenerated.",
    "{3}, {T}: Exile the top card of your library. Until the beginning of your next upkeep, you may play that card.",
    "{3}, {T}: Target creature gains first strike until end of turn.",
    "Whenever a player casts a red spell, you may pay {3}. If you do, untap target permanent.",
    "{1}, {T}: Tap target artifact, creature, or land.",
    "Whenever a player casts a blue spell, you may pay {3}. If you do, untap target permanent.",
    "Whenever a player casts a green spell, you may pay {3}. If you do, untap target permanent.",
    "Whenever a player casts a white spell, you may pay {3}. If you do, untap target permanent.",
    "Cumulative upkeep {3} \nIf tapped for mana, Plains produce {R}, Islands produce {G}, Swamps produce {W}, Mountains produce {U}, and Forests produce {B} instead of any other type.",
    "Whenever a player casts a black spell, you may pay {3}. If you do, untap target permanent.",
    "{4}, {T}: The next time a source of your choice would deal damage to you this turn, prevent that damage.",
    "{2}: Prevent the next 1 damage that would be dealt to you this turn.",
    "Creatures with landwalk abilities can be blocked as though they didn't have those abilities.",
    "{2}, Sacrifice a snow land: Prevent all combat damage that would be dealt this turn.",
    "During your turn, creatures you control get +2/+0.\nDuring turns other than yours, creatures you control get -0/-2.",
    "{3}, {T}: Target creature gains trample until end of turn.",
    "{2}, {T}: Target creature with power 3 or less gains flying until end of turn.",
    "Sacrifice a land: You gain 2 life.",
    "{3}: You may put a Minotaur permanent card from your hand onto the battlefield.",
    "Creature spells cost {2} more to cast.",
    "{4}, {T}: Target creature can't be blocked this turn except by Walls.",
    "{3}, {T}: Target player looks at the top three cards of their library, puts one of them back on top of their library, then exiles the rest.",
    "{X}{X}{1}, {T}: Tap X target lands.",
    "{1}, {T}: Target land becomes the basic land type of your choice until end of turn.",
    "{3}: If your library has ten or more cards in it, target opponent looks at the top ten cards of your library and separates them into two face-down piles. Exile one of those piles. Search the other pile for a card, put it into your hand, then shuffle the rest of that pile into your library.",
    "{2}: Put the top card of your graveyard on the bottom of your library.",
    "Each player may play an additional land during each of their turns.\nWhenever a land is tapped for mana, return it to its owner's hand.",
    "{2}, {T}: The next time a source of your choice would deal damage to you this turn, prevent that damage. Exile cards from the top of your library equal to the damage prevented this way.",
    "{2}, {T}: Until end of turn, target creature you control gains flying and has base toughness 1.",
    "Activated abilities of creatures can't be activated.",
    "{2}, {T}, Sacrifice a creature: Draw a card.",
    "Players have no maximum hand size.\nAt the beginning of each player's draw step, that player draws an additional card, then discards a card.",
    "{3}, {T}: Create a 0/1 colorless Prism artifact creature token.\nSacrifice a Prism token: Add one mana of any color.",
    "{3}, {T}: Target creature you control gets +2/+2 until end of turn. Return it to its owner's hand at the beginning of the next end step. ",
    "Spells cost {1} less to cast.",
    "Each player skips their untap step.\nAt the beginning of each player's upkeep, that player simultaneously untaps each tapped artifact, creature, and land they control and taps each untapped artifact, creature, and land they control.",
    "At the beginning of each player's draw step, that player puts the cards in their hand on the bottom of their library in any order, then draws that many cards.",
    "{T}: Look at the top card of target player's library. If it's a nonland card, you may pay 2 life. If you do, put it into that player's graveyard.",
    "Prevent all damage that would be dealt to creatures.",
    "{3}, {T}: Until end of turn, you may cast instant and sorcery spells from the top of your graveyard. If a spell cast this way would be put into a graveyard, exile it instead.",
    "{1}, {T}: Target creature gains flanking until end of turn. ",
    "Whenever a land an opponent controls is tapped for mana, tap all lands that player controls that could produce any type of mana that land could produce.",
    "Activated abilities of artifacts can't be activated.",
    "{2}: Until end of turn, target nonartifact creature gets +1/+0 and becomes an artifact in addition to its other types.",
    "{5}, {T}: Reveal the top three cards of your library. Target opponent chooses one of those cards. Put that card into your graveyard, then draw two cards.",
    "{T}: Tap target artifact you don't control.",
    "{2}: Draw a card. Any player may activate this ability but only during their draw step.",
    "Sacrifice a creature: Target player mills cards equal to the sacrificed creature's power.",
    "{4}, {T}: An opponent chooses target creature they control. Create a token that's a copy of that creature. That token gains haste until end of turn. Exile the token at the beginning of the next end step. Activate only as a sorcery.",
    "Green spells you cast cost {1} less to cast.",
    "{5}, {T}: Draw two cards, then discard a card.",
    "{T}, Sacrifice a basic land: Target creature gains landwalk of each of the land types of the sacrificed land until end of turn. ",
    "{2}, {T}: Draw a card. Activate only if you have no cards in hand.",
    "{3}, {T}: Target player mills two cards. If two cards that share a color were milled this way, repeat this process.",
    "Black spells you cast cost {1} less to cast.",
    "If a creature with a magnet counter on it attacks, all creatures with magnet counters on them attack if able.\nWhenever a creature with a magnet counter on it attacks, all creatures with magnet counters on them block that creature this turn if able.\n{1}, {T}: Put a magnet counter on target creature.",
    "{T}: Target creature you control gets +1/+0 and gains flying until end of turn. Destroy that creature at the beginning of the next end step.",
    "White spells you cast cost {1} less to cast.",
    "{4}, {T}: Target opponent chooses one of the top two cards of your graveyard. Exile that card and put the other one into your hand.",
    "{2}, {T}, Choose flying, first strike, trample, or shadow: Until end of turn, target creature with the chosen ability loses it and another target creature gains it.",
    "{2}, {T}: You may tap or untap target creature.",
    "Red spells you cast cost {1} less to cast.",
    "Blue spells you cast cost {1} less to cast.",
    "At the beginning of your upkeep, if you have three or fewer cards in hand, Scalding Tongs deals 1 damage to target opponent or planeswalker.",
    "{1}, {T}: Exile any number of cards from your hand face down. Put that many cards from the top of your library into your hand. Then look at the exiled cards and put them on top of your library in any order.",
    "{T}: Prevent the next 1 damage that would be dealt to target creature this turn.",
    "Creatures with power greater than the number of cards in your hand can't attack.",
    "Activated abilities of creatures cost {1} less to activate. This effect can't reduce the mana in that cost to less than one mana.",
    "Whenever a player plays a land, that player draws a card.",
    "{3}, {T}: Create a 1/1 colorless Insect artifact creature token with flying and haste named Hornet. Destroy it at the beginning of the next end step.",
    "Each creature gets +1/+1 for each other creature on the battlefield that shares at least one creature type with it. ",
    "{1}, {T}: Return target creature to its owner's hand unless its controller pays {1}.",
    "{1}, {T}, Discard a card: Regenerate target creature.",
    "Buyback costs cost {2} less.",
    "{2}, {T}, Discard your hand: Counter target noncreature spell.",
    "You have no maximum hand size.",
    "Spells cost {1} more to cast.",
    "{X}, {T}: Search your library for a creature card with mana value X or less, reveal it, put it into your hand, then shuffle.",
    "{1}, Sacrifice a permanent: You gain 1 life.",
    "{3}, {T}: Put a +1/+1 counter on target creature.",
    "Cycling abilities you activate cost {2} less to activate.",
    "At the beginning of your draw step, draw an additional card.\nAt the beginning of your end step, discard your hand.",
    "Whenever a creature dies, if another creature is on the battlefield, return the first card to the battlefield under its owner's control at the beginning of the next end step.",
    "{X}, {T}: Tap X target lands.",
    "At the beginning of each player's upkeep, return to its owner's hand each creature that player controls with power greater than the number of cards in their hand.",
    "{5}, {T}: Shuffle your library, then reveal the top card. Until end of turn, for as long as that card remains on top of your library, play with the top card of your library revealed and you may play that card without paying its mana cost. ",
    "At the beginning of each player's upkeep, that player may pay 2 life. If they don't, they return a permanent they control to its owner's hand.",
    "If a source would deal damage to you, prevent 1 of that damage.",
    "{1}, {T}: Untap target artifact.",
    "{3}: Each player mills two cards.",
    "No more than two creatures can attack you each combat.",
    "A player who controls more permanents than each other player can't play lands or cast artifact, creature, or enchantment spells. That player may sacrifice a permanent for that player to ignore this effect until end of turn.",
    "Each spell costs {3} more to cast except during its controller's turn.",
    "{4}, {T}: You may put a creature card from your hand onto the battlefield.",
    "Echo {3} \n{1}, {T}: Tap target artifact, creature, or land.",
    "Whenever an artifact or enchantment is put into your graveyard from the battlefield, you gain 1 life.",
    "All permanents are colorless.",
    "Echo {6} \n{T}: Draw a card.",
    "{T}: You gain 1 life.",
    "{3}, {T}: Choose a number greater than 0 and a color. Target opponent reveals their hand. If that opponent reveals exactly the chosen number of cards of the chosen color, you draw a card.",
    "{T}: Return another target permanent you control and all Auras you control attached to it to their owner's hand. Activate only during your turn.",
    "Players can't untap more than one nonbasic land during their untap steps.",
    "Green spells you cast cost {1} less to cast.",
    "Black spells you cast cost {1} less to cast.",
    "White spells you cast cost {1} less to cast.",
    "Red spells you cast cost {1} less to cast.",
    "Blue spells you cast cost {1} less to cast.",
    "Green spells you cast cost {1} less to cast.",
    "Black spells you cast cost {1} less to cast.",
    "White spells you cast cost {1} less to cast.",
    "Red spells you cast cost {1} less to cast.",
    "Blue spells you cast cost {1} less to cast.",
    "Players can't untap more than one nonbasic land during their untap steps.",
    "Creature tokens you control have flying.\n{2}{G}{U}, {T}, Sacrifice a token: Create a 4/4 green Beast creature token. Activate only as a sorcery.",
    "Whenever a player casts a spell, if no colored mana was spent to cast it, counter that spell.",
    "Activated abilities of creatures can't be activated.",
    "Sacrifice a land: You gain 2 life.",
    "Creature tokens you control have flying.\n{2}{G}{U}, {T}, Sacrifice a token: Create a 4/4 green Beast creature token. Activate only as a sorcery.",
    "Whenever a player casts a spell, if no colored mana was spent to cast it, counter that spell.",
    "Whenever a player casts a spell, if no colored mana was spent to cast it, counter that spell.",
    "Sacrifice a creature: Target player mills cards equal to the sacrificed creature's power.",
    "Suspend 3—{0} \n{T}: Add one mana of any color."
]