[
    "Defender \nFlying",
    "Flash \nFirst strike ",
    "Other Soldier creatures get +1/+1 and have first strike. ",
    "{T}: Target creature gets +1/+1 until end of turn.",
    "{1}{W}{W}: Target creature gets +1/+1 until end of turn.",
    "{W}, {T}: Tap target creature.",
    "{W}, {T}: Put target Aura card from a graveyard onto the battlefield under your control attached to a creature you control.",
    "First strike, protection from black and from red ",
    "{T}: Prevent the next 1 damage that would be dealt to any target this turn.",
    "Flying, vigilance",
    "Flying, first strike ",
    "Flying, double strike",
    "Whenever another creature enters, you gain 1 life.",
    "{2}: Target green or blue creature gets +0/+1 until end of turn.",
    "{7}{W}: You gain 5 life.",
    "Vigilance ",
    "Flying",
    "You have shroud. ",
    "First strike ",
    "Flying\nCreatures can't attack you unless their controller pays {2} for each creature they control that's attacking you.",
    "First strike",
    "Flying \n{1}{U}: Target player reveals the top card of their library.",
    "{T}: Target creature with power 2 or less can't be blocked this turn.",
    "At the beginning of each player's upkeep, that player mills X cards, where X is the number of cards in their hand.",
    "Flying ",
    "{T}: Draw a card, then discard a card.",
    "{U}, {T}: You may tap or untap target creature.",
    "Islandwalk ",
    "{T}: Gain control of target creature for as long as that creature is enchanted.",
    "{2}: Target white or black creature gains flying until end of turn. ",
    "{U}, {T}: Return target permanent you control to its owner's hand.",
    "Defender, flying ",
    "Swampwalk ",
    "At the beginning of your upkeep, you draw X cards and you lose X life, where X is the number of Zombies you control.",
    "{2}: Target blue or red creature gets +1/+0 until end of turn.",
    "Other Zombie creatures get +1/+1.\n{1}{B}, {T}: Return target Zombie card from your graveyard to your hand.",
    "{T}: Destroy target tapped creature.",
    "Fear ",
    "Other Goblins get +1/+1 and have mountainwalk.",
    "Haste ",
    "{2}: Target black or green creature gains haste until end of turn. ",
    "Mountainwalk ",
    "Menace ",
    "If an opponent controls at least four more creatures than you, this spell costs {6} less to cast.\nTrample ",
    "Flying\n{T}: Add one mana of any color.",
    "Reach ",
    "Other Elf creatures get +1/+1 and have forestwalk. ",
    "{G}, {T}: You may put a creature card from your hand onto the battlefield.",
    "Creature spells can't be countered.",
    "Lands you control have \"{T}: Add one mana of any color.\"",
    "{T}: Add {G}.",
    "{2}: Target red or white creature gains trample until end of turn. ",
    "Shroud ",
    "Forestwalk ",
    "Untap all permanents you control during each other player's untap step.",
    "{T}: You may put a land card from your hand onto the battlefield. Activate only as a sorcery.",
    "Trample \nAt the beginning of your upkeep, return a green creature you control to its owner's hand.",
    "Flash \nReach ",
    "At the beginning of each upkeep, create a 1/1 green Saproling creature token.",
    "Defender ",
    "Protection from black \n{2}: Exile target card from a graveyard.",
    "Whenever an Angel you control enters, you gain 4 life.\nWhenever an Angel you control dies, create a 1/1 white Spirit creature token with flying.",
    "Lifelink ",
    "Double strike",
    "Flying\nVigilance ",
    "Flying\n{3}{W}: Put a +1/+1 counter on another target creature with flying.",
    "{T}: You gain 1 life.",
    "When Octoprophet enters, scry 2. ",
    "Whenever another blue creature you control enters, target player mills two cards.",
    "Flash \nFlying\n{3}{U}: Draw a card.",
    "Flying\nCreature spells with flying you cast cost {1} less to cast.",
    "Protection from green \nCreatures your opponents control can't have +1/+1 counters put on them.",
    "Whenever you gain life, each opponent loses 1 life.",
    "Deathtouch ",
    "At the beginning of your upkeep, discard a card.",
    "Deathtouch \nLifelink ",
    "{3}, {T}, Sacrifice an artifact or land: Draw a card.",
    "Haste \n{T}: Another target creature with power 2 or less can't be blocked this turn.",
    "{5}{G}, {T}: Look at the top four cards of your library. You may reveal a creature card from among them and put it into your hand. Put the rest on the bottom of your library in a random order.",
    "{T}: Add {G}. If you control four or more creatures, add {G}{G} instead.",
    "Flash\nOther Wolves and Werewolves you control get +1/+1.\nAt the beginning of your end step, if you didn't cast a spell this turn, create a 2/2 green Wolf creature token.",
    "Trample \nOther Elementals you control have trample.",
    "{G}{G}{G}{G}{G}: Untap target land you control. It becomes a 5/5 Elemental creature with haste. It's still a land. ",
    "Whenever another creature you control enters, each opponent loses 1 life.",
    "Flying\nOther creatures you control with flying get +1/+1.",
    "Flying\nHaste ",
    "{2}{B}{R}: Destroy target creature that was dealt damage this turn.",
    "Other Vampires you control get +1/+1.",
    "Whenever an opponent is dealt noncombat damage, creatures you control get +1/+0 until end of turn.",
    "Flying \nWhenever one or more creatures you control attack, they gain indestructible until end of turn. ",
    "Whenever another creature you control enters, you gain 1 life.",
    "Flying \nVigilance \nOther creatures you control have vigilance.",
    "Flying \n{5}{B}{B}: Return target creature card from your graveyard to the battlefield tapped.",
    "{6}{B}: Each opponent loses 2 life and you gain 2 life.",
    "Flying, haste",
    "Trample \nOther creatures you control have trample.",
    "{2}{W}, {T}: Tap target creature.",
    "{T}: Target attacking creature gets +1/+1 until end of turn.",
    "Renown 1 ",
    "Renown 1 \n{W}{W}: Tap target creature.",
    "Vigilance \nAt the beginning of combat on each opponent's turn, tap target creature that player controls.",
    "Flying \nRenown 1 ",
    "Vigilance \nRenown 1 ",
    "Flying\nNoncreature spells cost {1} more to cast.",
    "Lifelink \nRenown 1 ",
    "Flying \nProwess ",
    "{T}: Scry 1. ",
    "As an additional cost to cast this spell, exile two creature cards from your graveyard.\nTrample",
    "Flying\nWhenever you cast a noncreature spell, creatures you control get +1/+1 until end of turn.",
    "Whenever you cast an enchantment spell, you may have target creature get -2/-2 until end of turn.",
    "First strike \nRenown 1 ",
    "Flying\nAt the beginning of your draw step, draw an additional card.\nAt the beginning of your end step, discard your hand.",
    "Trample \nIf another red source you control would deal damage to a permanent or player, it deals that much damage plus 1 to that permanent or player instead.",
    "Haste \nRenown 1 ",
    "Reach",
    "Enchantment spells you cast cost {1} less to cast.\nWhenever you cast an enchantment spell, you gain 1 life.",
    "Deathtouch \nRenown 1 ",
    "Trample \nRenown 2 ",
    "Vigilance \nReach ",
    "Whenever a creature you control becomes blocked, it gets +1/+1 until end of turn.\n{1}{G}: Target creature you control gains trample until end of turn. ",
    "Renown 2 \nWhenever a creature you control becomes renowned, draw a card.",
    "Vigilance \nRenown 2 ",
    "Double strike ",
    "Flash \nFlying\nOther creatures you control with flying get +1/+1.",
    "This spell can't be countered.\nTrample ",
    "Protection from black and from red\nWhenever another creature enters, you may gain 1 life.",
    "{1}{W}: Return target artifact card with mana value 1 or less from your graveyard to your hand.",
    "You may pay {W}{U}{B}{R}{G} rather than pay this spell's mana cost.\nTrample\nAt the beginning of your upkeep, you may return target artifact card from your graveyard to the battlefield.",
    "{T}: Prevent the next 2 damage that would be dealt to any target this turn.",
    "You may pay {W}{U}{B}{R}{G} rather than pay this spell's mana cost.\nTrample\nAt the beginning of your upkeep, you may draw two cards.",
    "Affinity for artifacts \nFlying",
    "You may pay {W}{U}{B}{R}{G} rather than pay this spell's mana cost.\nTrample\nAt the beginning of your upkeep, you may pay 2 life. If you do, search your library for a card, then shuffle and put that card on top.",
    "Flying\n{T}: Target player loses 1 life.",
    "Fear \nWhenever a player casts a spell, sacrifice a creature.",
    "Flying\nWhenever a player casts a spell, you lose 1 life.",
    "Flying\nEach creature you control is a Vampire in addition to its other creature types and has \"Whenever this creature deals damage to a creature, put a +1/+1 counter on this creature.\"",
    "You may pay {W}{U}{B}{R}{G} rather than pay this spell's mana cost.\nTrample\nAt the beginning of your upkeep, you may untap target creature and gain control of it until end of turn. That creature gains haste until end of turn.",
    "{R}, Sacrifice two artifacts: Destroy target artifact.",
    "{R}, Sacrifice an artifact: Target creature can't block this turn.",
    "You may pay {W}{U}{B}{R}{G} rather than pay this spell's mana cost.\nTrample\nAt the beginning of your upkeep, you may create a 3/3 green Beast creature token.",
    "{T}: Add one mana of any color that a land an opponent controls could produce.",
    "{G}, {T}, Sacrifice a Forest: Regenerate target creature.",
    "{3}{G}, {T}: Target creature gets +X/+X until end of turn, where X is the number of artifacts your opponents control.",
    "Flying\nVehicles you control have flying.",
    "Improvise \nHexproof ",
    "Improvise \nFlying",
    "Menace",
    "Deathtouch, lifelink",
    "Improvise \nFlying\nAt the beginning of your end step, each opponent discards a card.\n{1}{B}, Sacrifice an artifact: Target creature gets -2/-2 until end of turn.",
    "Improvise \nWhenever a nontoken artifact you control is put into a graveyard from the battlefield, create a 1/1 colorless Servo artifact creature token.",
    "Improvise \nTrample, haste",
    "Improvise \nMenace",
    "At the beginning of combat on your turn, target artifact creature you control gets +2/+0 until end of turn.",
    "If one or more counters would be put on an artifact or creature you control, that many plus one of each of those kinds of counters are put on that permanent instead.\nIf you would get one or more counters, you get that many plus one of each of those kinds of counters instead.",
    "{T}: Destroy target Djinn or Efreet.",
    "Trample",
    "Protection from red",
    "Trample; banding ",
    "{T}: Draw a card and reveal it. If it isn't a land card, discard it.",
    "{R}: Tap target Wall.",
    "Damage that would reduce your life total to less than 1 reduces it to 1 instead.",
    "{T}: Target creature can't be regenerated this turn.",
    "At the beginning of your upkeep, target non-Wall creature an opponent controls gains forestwalk until your next upkeep. ",
    "{T}: Target attacking creature has base power 0 until end of turn.",
    "{W}{W}, {T}: Return target artifact card from your graveyard to your hand.",
    "{T}: Prevent the next 2 damage that would be dealt to target artifact creature this turn.",
    "{T}, Sacrifice an artifact: Draw a card.",
    "{T}, Sacrifice an artifact: Add an amount of {B} equal to the sacrificed artifact's mana value.",
    "{T}: Until your next upkeep, target noncreature artifact becomes an artifact creature with power and toughness each equal to its mana value.",
    "{T}, Sacrifice an artifact: Put a +1/+1 counter on target creature. Activate only during your upkeep.",
    "{T}: Target player chooses a card name, then reveals the top card of their library. If that card has the chosen name, that player puts it into their hand. If it doesn't, the player puts it into their graveyard.",
    "Plainswalk ",
    "Flying, first strike",
    "Defender \nProtection from black",
    "{T}: Target creature gets -1/-0 until end of turn.",
    "{T}, Sacrifice a creature: Return target creature card from your graveyard to the battlefield. Activate only during your upkeep.",
    "Rampage 3 ",
    "Rampage 2 ",
    "{T}: You may tap or untap target artifact an opponent controls.",
    "Other Kobold creatures you control get +0/+1 and have trample.",
    "First strike\nOther Kobold creatures you control have first strike.",
    "Other Kobold creatures you control get +1/+0.",
    "Mountainwalk \nProtection from white",
    "{T}: If target Plains is tapped for mana, it produces colorless mana instead of white mana. ",
    "{T}: Destroy target blue creature.",
    "Trample\nRampage 2 ",
    "Flying\n{G}, {T}: Add {R}.",
    "{2}{G}{G}: Create a 1/1 green Wolf creature token named Wolves of the Hunt. It has \"bands with other creatures named Wolves of the Hunt.\" ",
    "Flying\n{G}{G}{G}, {T}: Target creature gains flying until end of turn.",
    "{1}{G}, {T}: Target creature gets -2/-0 until end of turn.",
    "{T}: Target creature loses flying until end of turn.",
    "{T}: Target creature loses all \"bands with other\" abilities until end of turn.",
    "{1}{W}, {T}: Destroy target black creature.",
    "Protection from red; banding ",
    "First strike; banding ",
    "{T}: Destroy target creature with islandwalk.",
    "{B}, {T}: Exile target artifact card from a graveyard. You gain 2 life.",
    "{B}{B}{B}, {T}: Target opponent reveals their hand and discards a creature card at random. Activate only during your turn.",
    "{T}: You may put a Goblin permanent card from your hand onto the battlefield.\n{R}: Target Goblin gains protection from white until end of turn.",
    "{T}, Sacrifice another Orc or Goblin: Other Orc creatures get +1/+1 until end of turn.",
    "{T}: Add {R}.",
    "Defender",
    "{G}{G}{G}{G}, {T}: Regenerate target creature.",
    "{G}{G}{G}{G}, {T}: Target creature gains forestwalk until end of turn. \n{T}: Target creature loses forestwalk until end of turn.",
    "{G}{G}, {T}: Target creature can't be regenerated this turn. Damage that would be dealt to that creature this turn can't be prevented or dealt instead to another permanent or player. When the creature dies this turn, exile the creature.",
    "{1}{W}: Prevent the next 1 damage that would be dealt to any target this turn.",
    "{T}, Tap three untapped white creatures you control: Destroy target creature.",
    "{1}{W}: Target Soldier creature gets +1/+0 until end of turn.",
    "Banding ",
    "{1}, {T}: Target creature gains first strike until end of turn.",
    "{U}: Tap target green creature.",
    "{U}{U}, {T}: Target creature gains shroud until end of turn. Activate only during your upkeep. ",
    "{U}, {T}: Counter target spell unless its controller pays {1}.",
    "Black spells you cast cost {B} more to cast.",
    "{1}{B}: Counter target black spell unless that spell's controller pays {B} or {3}.",
    "{R}, {T}, Discard a card: Put a +0/+1 counter or a +1/+0 counter on target creature.",
    "{1}{R}: Target Dwarf creature gets +1/+0 until end of turn.",
    "Sacrifice a Goblin: Regenerate target creature.",
    "{1}: Flip a coin. If you win the flip, target Orc creature gets +2/+0 until end of turn. If you lose the flip, it gets -0/-2 until end of turn.",
    "{T}: Look at the top three cards of target player's library.",
    "{1}{G}, {T}: Target creature doesn't untap during its controller's next untap step.",
    "{G}, {T}: Untap target attacking creature you control. Prevent all combat damage that would be dealt to and dealt by it this turn.",
    "{1}{G}, {T}, Sacrifice a creature: Forests you control become 2/3 creatures until end of turn. They're still lands.",
    "{T}, Sacrifice a green creature: Target land becomes a Forest. ",
    "{T}: Prevent the next 1 damage that would be dealt to any target this turn. If it's a green creature, prevent the next 2 damage instead.",
    "{1}{W}: Target green creature gains first strike until end of turn.",
    "Flying; first strike; banding ",
    "{T}, Pay 1 life: Counter target black spell.",
    "{T}: Target snow land becomes a 2/2 creature until end of turn. It's still a land.",
    "{T}: Change the text of target white enchantment you control that doesn't have cumulative upkeep by replacing all instances of one color word with another.  That enchantment gains \"Cumulative upkeep {1}.\" ",
    "Flying\nCumulative upkeep {U} ",
    "Defender, flying, first strike\nCumulative upkeep {U} ",
    "{T}, Discard a nonblack card: Draw a card.\n{T}, Discard a black card: Draw two cards, then discard one of them.",
    "{1}{U}, {T}: Untap target artifact an opponent controls and gain control of it until end of turn. It gains haste until end of turn. When you lose control of the artifact, tap it.",
    "Cumulative upkeep {1} \n{T}: Put a music counter on target creature. If it doesn't have \"At the beginning of your upkeep, destroy this creature unless you pay {1} for each music counter on it,\" it gains that ability.",
    "Flying, trample",
    "Flying\nMenace ",
    "{2}{B}, {T}: Target player discards a card. Activate only during your turn.",
    "{T}, Sacrifice a creature: Target creature gets +2/+2 until end of turn.\n{1}{U}{U}, Sacrifice a creature: Counter target creature spell.",
    "{2}{R}: Target creature gets +1/+0 until end of turn.\n{U}{U}: Target creature you control gains flying until end of turn. Sacrifice it at the beginning of the next end step.",
    "Snow swampwalk ",
    "{T}: Untap target blue creature.\n{T}: Choose target non-Wall creature the active player has controlled continuously since the beginning of the turn. That creature attacks this turn if able. Destroy it at the beginning of the next end step if it didn't attack this turn. Activate only before attackers are declared.",
    "{T}, Pay 1 life: Counter target white spell.",
    "{2}{R}, {T}: Choose a land type. Target creature you control gains snow landwalk of the chosen type until end of turn. Return that creature to its owner's hand at the beginning of the next end step. ",
    "{T}: Target land becomes a Swamp until its controller's next untap step.",
    "{R}{R}, {T}: Target creature can't be regenerated this turn.\n{B}{B}{R}, {T}: Regenerate target black or green creature.\n{R}{G}{G}, {T}: Regenerate target black or green creature.",
    "{R}, {T}: Look at the top eight cards of your library. Exile four of them at random, then put the rest on top of your library in any order.",
    "{T}, Sacrifice a Forest: Add three mana in any combination of {R} and/or {G}.",
    "{1}{G}, {T}: Counter target activated ability from an artifact source. ",
    "{3}{G}, {T}: You may tap or untap target artifact, creature, or land.",
    "{1}{G}: Folk of the Pines gets +1/+0 until end of turn.",
    "{2}{G}, {T}: Untap target creature.",
    "{T}: Add {G}{G}.",
    "{T}: Untap target land.",
    "Snow forestwalk ",
    "Flying, protection from red",
    "{T}: Tap target creature with power 2 or less.",
    "Protection from black",
    "{W}{W}, {T}: Prevent the next 4 damage that would be dealt this turn to target creature you control. Tap that creature. It doesn't untap during your next untap step.",
    "{T}: Prevent the next 1 damage that would be dealt to any target this turn.\n{1}{W}{W}, {T}: Target creature gains vigilance until end of turn.",
    "First strike, protection from red",
    "First strike, haste",
    "{T}: Another target Minotaur creature gets +1/+1 until end of turn.",
    "Minotaur creatures get +1/+0.",
    "{1}{R}, {T}: Target Dwarf creature gains mountainwalk until end of turn. ",
    "Flying\nOther Faerie creatures you control get +0/+1.\n{T}: Other Faerie creatures you control get +1/+0 until end of turn.",
    "{T}: You may put a Faerie permanent card from your hand onto the battlefield.\n{2}{G}: Target green creature gains protection from black until end of turn.",
    "{2}, Exile the top card of your library: You gain 1 life.",
    "{3}, Exile the top four cards of your library: The next time a source of your choice would deal damage to you this turn, prevent that damage.",
    "Cumulative upkeep {1}{W} \nDamage that would reduce your life total to less than 1 reduces it to 1 instead.",
    "{T}, Untap a tapped land an opponent controls: Add one mana of any type that land could produce.",
    "{W}, {T}: Prevent the next 2 damage that would be dealt to target creature this turn. Target opponent may draw a card.",
    "{T}, Sacrifice two lands: Draw three cards, then discard one of them.",
    "{T}, Sacrifice a creature and a Swamp: Destroy target nonartifact creature. It can't be regenerated.\n{T}, Sacrifice a creature and a snow Swamp: Destroy target creature. It can't be regenerated.",
    "{2}{R}, Exile a creature card from your graveyard: Create a 3/1 black and red Graveborn creature token with haste. Sacrifice it at the beginning of the next end step.",
    "{T}, Sacrifice a black or artifact creature: Add an amount of {B} equal to the sacrificed creature's mana value.",
    "{R}: Add {B}.",
    "Haste\nRampage 1 ",
    "{X}{X}{1}: Destroy target noncreature artifact with mana value X.",
    "{R}, {T}: Target player shuffles their library.",
    "Cumulative upkeep—Have an opponent create a 1/1 red Survivor creature token. \nTrample; rampage 1 ",
    "All creatures able to block Elvish Bard do so.",
    "Trample, haste\nCumulative upkeep {G}{G} ",
    "If a spell would deal damage to a permanent or player, it deals that much damage minus 1 to that permanent or player instead.",
    "{G}, {T}: Target creature gets +0/+1 until end of turn.\n{U}, {T}: Put target creature you control on top of its owner's library.",
    "Flying, protection from black",
    "Flanking ",
    "Flying; banding ",
    "Flanking \n{1}{W}{W}: Target Knight creature gets +1/+1 until end of turn.",
    "Flying\n{U}: Azimaet Drake gets +1/+0 until end of turn. Activate only once each turn.",
    "Flying, protection from green",
    "Flying\n{1}{U}{U}: Target creature gains flying until end of turn.",
    "Islandwalk \nPhasing ",
    "Phasing ",
    "{W}, {T}: Target creature gains first strike until end of turn.\n{B}, {T}: Target creature gets +1/+0 until end of turn.",
    "Flying\nPhasing ",
    "{T}, Sacrifice a Swamp: Target creature gets +1/+1 until end of turn.\n{T}, Sacrifice a creature: Target creature gets +2/+2 until end of turn.",
    "At the beginning of your upkeep, put a -1/-1 counter on each creature.",
    "{B}, {T}: Target creature gets +1/+0 until end of turn.\n{G}, {T}: Target creature gets +0/+1 until end of turn.",
    "{2}{R}, {T}: Destroy target nonbasic land.",
    "{R}, {T}, Sacrifice a Goblin: Red creatures get +1/+1 until end of turn.",
    "Haste",
    "Shroud \nFlanking ",
    "{1}{G}, {T}: Create a 0/1 green Wall creature token with defender named Wood.\nSacrifice a token named Wood: Add {R}.",
    "Protection from blue",
    "Forestwalk \n{1}{G}{G}: Target creature gains forestwalk until end of turn.",
    "Islandwalk \nAt the beginning of your upkeep, you lose 2 life.",
    "Flying, protection from blue",
    "{W}, {T}: Target creature can't block this turn.",
    "First strike; reach ",
    "Trample\nAt the beginning of your upkeep, put a +1/+1 counter on each creature each opponent controls.",
    "Haste\nFlanking ",
    "Flash",
    "{G}, {T}: Target land becomes a 2/2 green creature that's still a land. ",
    "Return a Forest you control to its owner's hand: Untap target creature. Activate only once each turn.",
    "{T}, Sacrifice a land: Destroy target land.",
    "Whenever an enchantment is put into a graveyard from the battlefield, draw a card.",
    "Flying, trample\nCumulative upkeep {U}{R} ",
    "Flying\n{T}: If the top card of target player's graveyard is a creature card, put that card on top of that player's library.",
    "{T}: Counter target spell unless its controller pays {1} and 1 life.",
    "Vigilance",
    "{1}{W}, {T}: Prevent all combat damage that would be dealt by target blocked creature this turn.",
    "First strike\n{1}{W}: Tap target creature blocking Master of Arms.",
    "{W}, Exile a creature card from your graveyard: You gain 1 life.",
    "{W}{W}, {T}: Destroy target red permanent.",
    "Banding \nCumulative upkeep {1} ",
    "At the beginning of your upkeep, mill seven cards.",
    "{U}{U}, {T}: Target creature phases out. ",
    "{T}: Switch target creature's power and toughness until end of turn.",
    "Cumulative upkeep {G} ",
    "First strike\n{W}: Target creature gains first strike until end of turn.",
    "All Sliver creatures have \"{2}: This creature gets +0/+1 until end of turn.\"",
    "Creatures with power 3 or greater don't untap during their controllers' untap steps.",
    "{T}: Target opponent chooses any number of creatures they control. During that player's next turn, the chosen creatures attack if able, and other creatures can't attack. At the beginning of that turn's end step, destroy each of the chosen creatures that didn't attack this turn. Activate only during your turn.",
    "Shadow ",
    "Protection from black\nShadow ",
    "Protection from red\nShadow ",
    "All Sliver creatures have first strike.",
    "All Slivers have \"{2}, Sacrifice this permanent: Draw a card.\"",
    "You may cast Aura spells with enchant creature as though they had flash.",
    "Cast this spell only if you've cast another spell this turn.\nFlying",
    "Flying\n{T}, Tap two untapped creatures you control: Return target permanent to its owner's hand.",
    "Flying\n{T}: Target creature gains flying until end of turn.",
    "All Sliver creatures have flying.",
    "{T}: Put a bounty counter on target nonblack creature.\n{T}: Destroy target creature with a bounty counter on it.",
    "All Slivers have \"{2}: Regenerate this permanent.\"",
    "Flying\n{T}: Non-Wall creatures the active player controls attack this turn if able. At the beginning of the next end step, destroy each of those creatures that didn't attack this turn. Activate only during an opponent's turn and only before combat.",
    "All Slivers have \"{2}, Sacrifice this permanent: Target player discards a card at random. Activate only as a sorcery.\"",
    "{B}: Destroy target artifact, creature, or land you control.",
    "All Sliver creatures have \"{2}: This creature gets +1/+0 until end of turn.\"",
    "All Sliver creatures have haste.",
    "Sacrifice a Goblin: Target creature gets +1/+1 until end of turn.",
    "Flying; swampwalk ",
    "All Sliver creatures have trample.",
    "All Sliver creatures get +1/+1.",
    "Trample ",
    "This spell can't be countered.\nProtection from blue",
    "{T}: Untap target creature.",
    "{T}: Add {G}.\n{1}: Add {R} or {W}.",
    "{T}: Choose a creature card name. Reveal the top four cards of your library and put all of them with that name into your hand. Put the rest into your graveyard.",
    "{T}: Target land becomes an Island until end of turn.",
    "{T}: Target creature gains shadow until end of turn. ",
    "{T}: Target blocking creature gets -1/-1 until end of turn.",
    "{T}, Sacrifice a creature: Destroy target nonblack creature.",
    "Other black creatures get -1/-1.",
    "Defender \nFirst strike",
    "{G}, {T}: Reveal cards from the top of your library until you reveal a basic land card. Put that card into your hand and all other cards revealed this way into your graveyard.",
    "{T}: Target creature with flying gets -1/-1 until end of turn.",
    "All Slivers have \"{2}, Sacrifice this permanent: This permanent deals 2 damage to any target.\"",
    "All Slivers have shroud. ",
    "All Slivers have \"Pay 2 life: Return this permanent to its owner's hand.\"",
    "Whenever a Sliver becomes blocked, that Sliver gets +1/+1 until end of turn for each creature blocking it.",
    "All Slivers have \"{2}, Sacrifice this permanent: You gain 4 life.\"",
    "{W}, {T}: Choose target opponent who has more life than you do as you activate this ability. You gain 3 life.",
    "At the beginning of your upkeep, if all nonland permanents you control are white, you gain 1 life.",
    "{U}, {T}: Choose target opponent who has at least two more cards in hand than you do as you activate this ability. Draw a card.",
    "{1}{U}: Look at the top card of target player's library.",
    "{2}{B}, {T}: Target player discards a card. Activate only as a sorcery.",
    "Shadow \n{1}{B}, {T}: Destroy target creature with shadow.",
    "{B}, {T}: Choose target opponent who has at least two fewer creature cards in their graveyard than you do as you activate this ability. Destroy target nonblack creature that player controls.",
    "{X}{X}{B}: Destroy target nonblack creature with mana value X.",
    "{R}: Target creature can't be regenerated this turn.",
    "{T}: You choose target creature an opponent controls, and that opponent chooses target creature. Flip a coin. If you win the flip, destroy the creature you chose. If you lose the flip, destroy the creature your opponent chose.",
    "{G}, {T}: Choose target opponent who controls more creatures than you do as you activate this ability. Create a 2/2 green Beast creature token.",
    "Flying\n{T}: Target attacking or blocking creature gets +1/+1 until end of turn.",
    "Protection from black\nCycling {2} ",
    "Protection from red\nCycling {2} ",
    "Sacrifice an enchantment: You gain life equal to the sacrificed enchantment's mana value.",
    "Flying, vigilance\nEcho {2}{W}{W} ",
    "{T}: Destroy target creature with power 4 or greater.",
    "Flying \nFirst strike ",
    "Defender \nFirst strike\nCycling {2} ",
    "{1}{W}: Prevent all combat damage that would be dealt this turn by target attacking creature with flying.",
    "{1}{W}, {T}: Target creature becomes an enchantment and loses all abilities until a player casts a creature spell.",
    "{T}: Counter target spell unless its controller pays {1}.",
    "Flying\nCycling {2} ",
    "Cycling {2} ",
    "Flying\nShroud ",
    "{2}{B}, {T}: Exile up to three target cards from a single graveyard.",
    "{B}{B}, {T}: Destroy target green creature.",
    "Flying\nDiscard a card: Add {B}.",
    "{B}{B}, {T}: Destroy target white creature.",
    "Echo {R} ",
    "Haste\nEcho {1}{R} ",
    "First strike, haste\nEcho {2}{R} ",
    "Echo {2}{R} ",
    "Mountainwalk \nEcho {1}{R}{R} ",
    "Echo {1}{G} ",
    "{T}: Untap two target lands.",
    "Shroud \nWhenever you cast an enchantment spell, draw a card.",
    "Shroud \nEcho {3}{G} ",
    "Creatures you control have \"{T}: Add {G}.\"",
    "Trample\nEcho {1}{G}{G} ",
    "{G}: Target creature gains trample until end of turn.",
    "Echo {G} ",
    "{T}: Add {G} for each Elf on the battlefield.",
    "Echo {4}{G} ",
    "Flying, protection from artifacts",
    "Flash\nProtection from red",
    "{T}: Destroy target Aura attached to a creature.",
    "{T}: Target creature you control gains protection from the color of your choice until end of turn.",
    "{T}: Draw a card.",
    "{1}{U}, {T}: Put target green creature on top of its owner's library.",
    "{T}: Target creature loses your choice of flying, first strike, or trample until end of turn.",
    "Flash\nProtection from white",
    "{T}: Choose target artifact a player controls and target artifact card in that player's graveyard. If both targets are still legal as this ability resolves, that player simultaneously sacrifices the artifact and returns the artifact card to the battlefield.",
    "Protection from blue\nCycling {2} ",
    "Flash\nEcho {2}{G} ",
    "{T}: Target creature gains forestwalk until end of turn. ",
    "Protection from artifacts",
    "Tap an untapped creature you control: Prevent the next 1 damage that would be dealt to target creature this turn.",
    "{2}{W}, {T}: Reveal any number of white cards in your hand. You gain 2 life for each card revealed this way.",
    "{T}: Prevent the next 4 damage that would be dealt to any target this turn.",
    "Flying\n{T}: Target attacking or blocking creature gets +2/+2 until end of turn.",
    "{2}{U}, {T}: Reveal any number of blue cards in your hand. Counter target spell unless its controller pays {1} for each card revealed this way.",
    "{U}{U}{U}, {T}: Return target permanent to its owner's hand.",
    "{2}{B}, {T}: Reveal any number of black cards in your hand. Target creature gets -X/-X until end of turn, where X is the number of cards revealed this way.",
    "{2}{G}, {T}: Reveal any number of green cards in your hand. Target creature gets +X/+X until end of turn, where X is the number of cards revealed this way.",
    "When you cast this spell, you gain 1 life for each colorless permanent you control.\nHexproof from each color\nAnnihilator 2 ",
    "You may reveal this card from your opening hand. If you do, at the beginning of your first upkeep, look at the top four cards of your library. You may put one of those cards back on top of your library. Exile the rest.\nWhen you cast this spell, exile target permanent that's one or more colors.",
    "Colorless spells you cast with mana value 7 or greater cost {1} less to cast.\nOther colorless creatures you control get +1/+1.",
    "When you cast this spell, draw two cards.\nFlying\nAnnihilator 1 \nEvoke {2}{U} ",
    "Kicker {G} and/or {1}{U}\nWhen you cast this spell, if it was kicked with its {G} kicker, exile target artifact or enchantment an opponent controls.\nWhen you cast this spell, if it was kicked with its {1}{U} kicker, return target creature an opponent controls to its owner's hand.",
    "Outlast {W} \nModified creatures you control have lifelink. ",
    "Whenever another nontoken creature you control enters, proliferate. ",
    "You may have Copycrook enter as a copy of any creature on the battlefield, except it has \"Whenever this creature attacks, it connives.\" ",
    "Vanishing 2 \nWhenever a player casts their second spell each turn, proliferate.",
    "Nonbasic lands are Islands.",
    "Devoid \nFlash\nWhen you cast this spell, counter target spell an opponent controls unless they pay {1}.\nFlying",
    "Devoid \nWhen you cast this spell, tap up to one target creature and put a stun counter on it. \nReach",
    "Deathtouch\n{4}{B}: Each opponent loses 2 life and you gain 2 life. This ability costs {4}{B} less to activate if you've drawn three or more cards this turn. Activate only once each turn.",
    "Fabricate 1 \nWhenever another creature or artifact you control is put into a graveyard from the battlefield, each opponent loses 1 life.",
    "Pay 1 life, Sacrifice another creature: Create a Treasure token. ",
    "Devoid \nTrample\nAt the beginning of combat on your turn, target creature you control gains haste and gets +X/+0 until end of turn, where X is the number of Eldrazi you control.",
    "Noncreature spells you cast from exile have convoke. \nAt the beginning of your first main phase, you may discard a card. If you do, exile the top two cards of your library, then choose one of them. You may play that card this turn.",
    "{T}: Add {G}.\nFerocious — {T}: Add {G}{G}{G}{G}. Activate only if you control a creature with power 4 or greater.\nEternalize {2}{G}{G} ",
    "{2}{G}: Adapt 2. \nModified creatures you control have trample. ",
    "Devoid \nReach\nLandfall — Whenever a land you control enters, look at the top card of your library. If it's a creature card, you may reveal it and put it into your hand. If you don't put the card into your hand, you may put it into your graveyard.",
    "{2}{B}{G}: Adapt 2. \nPermanents you control have \"Whenever one or more +1/+1 counters are put on this permanent, put an additional +1/+1 counter on it. This ability triggers only once each turn.\"",
    "Vigilance\nWight of the Reliquary gets +1/+1 for each creature card in your graveyard.\n{T}, Sacrifice another creature: Search your library for a land card, put it onto the battlefield tapped, then shuffle.",
    "Whenever another creature you control enters, you gain 1 life.\n{4}{W}, {T}: Exile another target creature you control, then return it to the battlefield under its owner's control.",
    "Whenever a token you control leaves the battlefield, each opponent loses 1 life and you gain 1 life.",
    "At the beginning of each upkeep, if you control no Snakes, create a 1/1 black Snake creature token with deathtouch.",
    "Reach, trample\nCascade ",
    "Sacrifice a land: Target creature you control gains shroud until end of turn. ",
    "Return an Elf you control to its owner's hand: Untap target creature. Activate only once each turn.",
    "Flying, lifelink",
    "Flying, vigilance\nOther nontoken creatures you control get +1/+1 and have vigilance.",
    "Flying\nPlainscycling {2} \nEternalize {2}{W}{W} ",
    "{3}, {T}: Investigate. ",
    "Affinity for tokens \nWhenever a token you control enters, tap target nonland permanent an opponent controls. It doesn't untap during its controller's next untap step.",
    "{U}, {T}: Draw a card, then discard a card.\nDelirium — {2}{U}, {T}: Draw a card. Activate only if there are four or more card types among cards in your graveyard.",
    "Islandwalk \n{1}, {T}: Tap target land.",
    "{1}, {T}, Pay 1 life: Draw a card. Activate only if you've discarded a card this turn.",
    "Flying, haste\nMadness {B} ",
    "Whenever a nontoken creature is put into your graveyard from the battlefield, create a 2/2 black Zombie creature token.\nWhen a creature is put into an opponent's graveyard from the battlefield, exile Magus of the Bridge.",
    "{T}: Surveil 1. ",
    "{T}, Sacrifice another creature: Each opponent loses 2 life and you gain 2 life.",
    "Trample\nSuspend 4—{1}{R} ",
    "Whenever you win a coin flip, create two Treasure tokens. \n{1}, {T}, Sacrifice another permanent: Flip a coin.",
    "{T}, Discard a card: Creatures you control gain haste until end of turn.",
    "Trample\nReinforce 2—{1}{G} \nScavenge {5}{G}{G} ",
    "Vigilance\n{5}{G}, {T}: Draw a card. This ability costs {1} less to activate for each +1/+1 counter on creatures you control.",
    "Exalted \n{T}: Add {B}, {R}, or {G}.",
    "Bushido 2 ",
    "{T}: Add one mana of any color.\nSuspend 2—{G} ",
    "Other Squirrels you control get +1/+1.",
    "Landfall — Whenever a land you control enters, create a Food token or a Treasure token. ",
    "Reach, lifelink\nOutlast {G/W} \nEach other creature you control without a +1/+1 counter on it has outlast {G/W}.",
    "Each spell you cast that's red or green costs {1} less to cast.",
    "Whenever you discard a card, you may pay {1}. If you do, amass Zombies 2. ",
    "Haste\nEcho—Discard a card. ",
    "Outlast {2} \nOther Sliver creatures you control have outlast {2}.",
    "Sliver creatures you control have exalted. ",
    "{T}: Another target creature you control gains protection from colorless or from the color of your choice until end of turn.",
    "Changeling ",
    "Other Cats you control get +2/+1.",
    "Sliver creatures you control have first strike.",
    "This spell costs {1} less to cast for each creature type among creatures you control. This effect can't reduce the amount of mana this spell costs by more than {5}.\nChangeling \nDouble strike",
    "{T}: Tap target creature. Activate only if you had a creature enter the battlefield under your control this turn.",
    "Sliver creatures you control have \"{2}: Untap this creature.\"",
    "Menace\nAt the beginning of your first main phase, you may sacrifice a creature. When you do, choose a nonland card name, then target player reveals their hand and discards all cards with that name.",
    "Each Sliver creature card in your graveyard has unearth {2}.\nUnearth {2} ",
    "Convoke \nFlying\nDevour 2 ",
    "Menace\nEvolve ",
    "Ninjutsu {3}{B} ",
    "Persist ",
    "Unblocked attacking Ninjas you control have lifelink.",
    "Changeling \nDeathtouch",
    "Hellbent — As long as you have no cards in hand, Sliver creatures you control have \"{T}: This creature deals 1 damage to target player or planeswalker.\"",
    "Sliver creatures you control get +2/+0.",
    "Haste\nExalted ",
    "Sliver creatures you control have \"{T}, Discard a card: Draw a card.\"",
    "This spell costs {1} less to cast for each land card in your graveyard.\nFlying, haste",
    "{R}: You may put a planeswalker card from your hand onto the battlefield. Sacrifice it at the beginning of the next end step.",
    "Sliver creatures you control have \"Whenever this creature is dealt damage, it deals that much damage to target player or planeswalker.\"",
    "Activated abilities of artifacts can't be activated.",
    "Level up {1} \nLEVEL 3-7\n4/4\nProtection from instants\nLEVEL 8+\n6/6\nProtection from everything",
    "{T}: Add {G}{G}{G}.",
    "Sliver creatures you control have \"Whenever this creature deals combat damage to a player, put a +1/+1 counter on it.\"",
    "Sliver creatures you control have flying and haste.",
    "Whenever another creature you control enters, put a +1/+1 counter on that creature.",
    "Ninjutsu {U}{B} \nWhenever a Ninja you control deals combat damage to a player, draw a card.",
    "Sliver creatures you control have \"When this creature enters, it deals 1 damage to target player or planeswalker and you gain 1 life.\"",
    "Reach\n{3}{B}{G}, Exile a creature card from your graveyard: Create a 1/2 green Spider creature token with reach, then each opponent loses 1 life for each Spider you control.",
    "Changeling \nWhenever you or a permanent you control becomes the target of a spell or ability an opponent controls, counter that spell or ability unless its controller pays {1}."
]