[
    "Whenever a creature you control enters, you gain life equal to its toughness.",
    "Creatures you control get +1/+1.",
    "Each creature you control can block an additional creature each combat.",
    "Soldier creatures have vigilance.\n{2}{W}: Create a 1/1 white Soldier creature token.",
    "Each player can't cast more than one spell each turn.",
    "Each noncreature artifact is an artifact creature with power and toughness each equal to its mana value. ",
    "At the beginning of each player's upkeep, that player returns a creature they control to its owner's hand.",
    "Your opponents play with their hands revealed.",
    "Whenever a creature you control dies, each other player sacrifices a creature.",
    "At the beginning of your upkeep, if twenty or more creature cards are in your graveyard, you win the game.",
    "{5}{R}{R}: Create a 5/5 red Dragon creature token with flying. ",
    "If a source would deal damage to a permanent or player, it deals double that damage to that permanent or player instead.",
    "If you would draw a card, you may instead choose land or nonland and reveal cards from the top of your library until you reveal a card of the chosen kind. Put that card into your hand and put all other cards revealed this way on the bottom of your library in any order.",
    "Creatures you control have trample. ",
    "Artifacts and lands enter tapped.",
    "Players don't lose unspent mana as steps and phases end.",
    "{1}{U}: Target creature gains flying until end of turn.",
    "Whenever a creature you control enters, scry 1. \nWhenever you cast a spell that targets a creature you control, draw a card.",
    "Whenever a creature you control dies, you gain 1 life and draw a card.",
    "Whenever you cast an enchantment spell, create a 4/4 white Angel creature token with flying.",
    "At the beginning of your upkeep, you may return target enchantment card from your graveyard to the battlefield.\nAs long as you control five or more enchantments, each other non-Aura enchantment you control is a creature in addition to its other types and has base power and base toughness each equal to its mana value.",
    "Whenever a creature you control enters, creatures you control get +1/+1 until end of turn.",
    "Instant and sorcery spells you cast cost {1} less to cast.\nWhenever you cast an instant or sorcery spell, scry 1.",
    "Whenever you draw a card, target opponent mills two cards. If two nonland cards that share a color were milled this way, repeat this process.\n{5}{U}: Draw a card, then discard a card.",
    "At the beginning of your upkeep, if you control an artifact, create a 1/1 colorless Thopter artifact creature token with flying.\nWhenever one or more artifact creatures you control deal combat damage to a player, draw a card.",
    "Whenever a creature dies, scry 1. \n{4}{B}: Each opponent loses 2 life and you gain 2 life. Activate only if there are four or more creature cards in your graveyard.",
    "If an opponent would gain life, that player loses that much life instead.",
    "Whenever a nontoken creature you control enters, you may pay {R}. If you do, create a token that's a copy of that creature. That token gains haste. Exile it at the beginning of the next end step.",
    "Whenever a creature you control with power 3 or greater enters, draw a card.",
    "{G}, Sacrifice a creature: Reveal cards from the top of your library until you reveal a creature card. Put that card into your hand and the rest on the bottom of your library in a random order.",
    "Landfall — Whenever a land you control enters, create a 2/2 green Elemental creature token.",
    "{2}: The next time an artifact source of your choice would deal damage to you this turn, prevent that damage.",
    "{U}, Discard an artifact card: Search your library for an artifact card with mana value 1 or less, reveal it, put it into your hand, then shuffle.",
    "Whenever you cast an instant or sorcery spell, you may pay {1}. If you do, scry 2. ",
    "Each creature has \"When this creature dies, choose target opponent. That player puts this card from its owner's graveyard onto the battlefield under their control at the beginning of the next end step.\"",
    "{1}{R}, Remove a +1/+1 counter or a charge counter from a permanent you control: Ion Storm deals 2 damage to any target.",
    "Whenever a creature you control is dealt damage, put a +1/+1 counter on it. ",
    "Whenever you cast an artifact spell, create a 1/1 colorless Thopter artifact creature token with flying.",
    "Revolt — At the beginning of your end step, if a permanent you controlled left the battlefield this turn, reveal the top card of your library. If it's a permanent card, you may put it onto the battlefield. Otherwise, you may put it on the bottom of your library.",
    "Revolt — At the beginning of your end step, if a permanent you controlled left the battlefield this turn, create a 1/1 colorless Servo artifact creature token.\n{1}, Sacrifice a creature: Scry 1.",
    "Blue creatures don't untap during their controllers' untap steps.\nAt the beginning of each player's upkeep, that player may choose any number of tapped blue creatures they control and pay {4} for each creature chosen this way. If the player does, untap those creatures.",
    "At the beginning of your upkeep, destroy the creature with the least power. It can't be regenerated. If two or more creatures are tied for least power, you choose one of them.\nWhen there are no creatures on the battlefield, sacrifice Drop of Honey.",
    "Players can't untap more than one artifact during their untap steps.",
    "All artifacts have \"At the beginning of your upkeep, sacrifice this artifact unless you pay {2}.\"",
    "Sacrifice a creature: Destroy target artifact. Activate only during your upkeep and only once each turn.",
    "Whenever an artifact an opponent controls becomes tapped or an opponent activates an artifact's ability without {T} in its activation cost, you gain 1 life.",
    "Creatures you control get +1/+1 as long as you control no nonartifact, nonwhite creatures.",
    "Wall creatures you control get +1/+0 and have banding. ",
    "Creatures with plainswalk can be blocked as though they didn't have plainswalk.",
    "{1}{W}: The next time a black or red source of your choice would deal damage to you this turn, prevent that damage.",
    "Artifacts, creatures, and lands your opponents control enter tapped.",
    "At the beginning of your upkeep, if an opponent controls more lands than you, you may search your library for up to three basic land cards, reveal them, put them into your hand, then shuffle.",
    "Whenever a Mountain an opponent controls becomes tapped, you gain 1 life.",
    "Creatures without flying can't attack.",
    "Whenever a player casts an enchantment spell, counter it.",
    "At the beginning of each player's upkeep, if that player controls a Plains, they gain 1 life.",
    "Whenever an opponent casts a creature spell that doesn't share a color with a creature you control, counter that spell unless that player pays {X}, where X is its mana value.",
    "If an opponent who controls at least as many lands as you do would put a land onto the battlefield, that player instead puts that land onto the battlefield then sacrifices a land.",
    "Creatures with islandwalk can be blocked as though they didn't have islandwalk.",
    "If a player would draw a card except the first one they draw in each of their draw steps, that player discards a card instead. If the player discards a card this way, they draw a card. If the player doesn't discard a card this way, they mill a card.",
    "{B}, Pay 2 life: Draw a card.",
    "Sacrifice a Swamp: Regenerate target black creature. ",
    "Creatures with swampwalk can be blocked as though they didn't have swampwalk.",
    "Creatures with mountainwalk can be blocked as though they didn't have mountainwalk.",
    "Creatures with forestwalk can be blocked as though they didn't have forestwalk.",
    "At the beginning of your draw step, you may draw two additional cards. If you do, choose two cards in your hand drawn this turn. For each of those cards, pay 4 life or put the card on top of your library.",
    "{U}: Until end of turn, if you tap a land you control for mana, it produces {U} instead of any other type.",
    "{U}{U}: Tap target creature without flying.",
    "Nonbasic lands are Mountains.",
    "Green creatures have forestwalk. ",
    "Sacrifice a Forest: You gain 3 life.",
    "Sacrifice a white creature: For each attacking red creature, prevent all combat damage that would be dealt by that creature this turn unless its controller pays {2}{R}.",
    "{1}{U}{U}, Sacrifice a blue creature: Create X 1/1 blue Camarid creature tokens, where X is the sacrificed creature's mana value.",
    "{U}{U}: For each attacking creature without flying, its controller may pay {1}. If that player doesn't, creatures you control blocking that creature gain first strike until end of turn.",
    "{R}: Target creature you control with toughness 2 or less gains flying until end of turn. Flip a coin at the beginning of the next end step. If you lose the flip, sacrifice that creature.",
    "Creatures you control have menace. ",
    "{2}{R}, Sacrifice two Goblins: Create three 1/1 red Goblin creature tokens.",
    "{1}{G}: Target blocking creature gets +0/+1 until end of turn.",
    "{G}{G}: Put a spore counter on target Fungus.",
    "{1}, Exile two creature cards from a single graveyard: Create a 1/1 green Saproling creature token.",
    "Blue creatures don't untap during their controllers' untap steps.\nAt the beginning of each player's upkeep, that player may choose any number of tapped blue creatures they control and pay {U} for each creature chosen this way. If the player does, untap those creatures.",
    "{W}, Sacrifice an enchantment: Destroy target enchantment.\n{3}{U}{U}: Counter target enchantment spell.",
    "{1}: The next time a black source of your choice would deal damage to you this turn, prevent that damage.",
    "{1}: The next time a blue source of your choice would deal damage to you this turn, prevent that damage.",
    "{1}: The next time a green source of your choice would deal damage to you this turn, prevent that damage.",
    "{1}: The next time a red source of your choice would deal damage to you this turn, prevent that damage.",
    "{1}: The next time a white source of your choice would deal damage to you this turn, prevent that damage.",
    "Play with your hand revealed.\nIf you would draw a card, reveal the top card of your library instead. If it's a creature card, put it into your graveyard. Otherwise, draw a card.\nWhenever a creature is put into your graveyard from the battlefield, return it to your hand.",
    "Cumulative upkeep {1} \nPrevent all damage that would be dealt by instant and sorcery spells.\nCreatures with flying don't untap during their controllers' untap steps.",
    "{W}{W}: Return target nonsnow land you control to its owner's hand.",
    "Cumulative upkeep {U} \n{1}: Target creature gains flying until end of turn.",
    "Cumulative upkeep {U} \nGreen creatures have \"Cumulative upkeep {1}.\"",
    "{1}{U}: Return target white or black creature card from your graveyard to the battlefield. That creature gains \"Cumulative upkeep {2}.\" If the creature would leave the battlefield, exile it instead of putting it anywhere else. ",
    "Cumulative upkeep {1} \n{U}, Discard a card: Draw a card.",
    "Cumulative upkeep {1} \nWhenever an opponent casts a noncreature spell, you may draw a card unless that player pays {4}.",
    "Cumulative upkeep {1}{U}{U} \nIf tapped for mana, Plains produce {R}, Swamps produce {G}, Mountains produce {W}, and Forests produce {B} instead of any other type.",
    "Cumulative upkeep {U} \nWhenever an Island is tapped for mana, its controller may add an additional {U}. If that Island is snow, its controller may add an additional {U}{U} instead. Spend this mana only to pay cumulative upkeep costs.",
    "Players play with their hands revealed.\nIf a player would draw a card, they reveal it instead. Then any other player may pay 2 life. If a player does, put that card into its owner's graveyard. Otherwise, that player draws a card.",
    "Cumulative upkeep—Pay {B} and 1 life. \nIf a land is tapped for mana, it produces {B} instead of any other type.",
    "Skip your draw step.\nWhenever you discard a card, exile that card from your graveyard.\nPay 1 life: Exile the top card of your library face down. Put that card into your hand at the beginning of your next end step.",
    "At the beginning of each upkeep, count the number of permanents. If the number is odd, until end of turn, red creatures get +1/+1 and whenever a player taps a Mountain for mana, that player adds an additional {R}. If the number is even, until end of turn, red creatures get -1/-1 and if a player taps a Mountain for mana, that Mountain produces colorless mana instead of any other type.",
    "{2}, Sacrifice a land: Put a +2/+2 counter on target creature. Activate only during any upkeep step.",
    "Sacrifice a snow Mountain: Prevent all combat damage that would be dealt this turn.",
    "All lands are no longer snow.",
    "Creatures without flying don't untap during their controllers' untap steps.\nAt the beginning of each player's upkeep, that player may choose any number of tapped creatures without flying they control and pay {2} for each creature chosen this way. If the player does, untap those creatures.",
    "Whenever a player attacks with one or more creatures, destroy all untapped non-Wall creatures that player controls that didn't attack, except for creatures the player hasn't controlled continuously since the beginning of the turn.",
    "Cast this spell only if you control a snow land.\nCumulative upkeep {2} \nCreatures with flying don't untap during their controllers' untap steps.",
    "Whenever a permanent becomes tapped, put a wind counter on it.\nIf a permanent with a wind counter on it would untap during its controller's untap step, remove all wind counters from it instead.",
    "Cumulative upkeep {1} \nAll creatures get -1/-0.\n{1}{G}: All creatures get -1/-0 until end of turn.",
    "Cumulative upkeep {2} \nIf a land is tapped for mana, it produces colorless mana instead of any other type.",
    "Whenever an Island an opponent controls becomes tapped, you may gain 1 life.",
    "{3}: Look at the top three cards of target player's library, then put them back in any order.",
    "Green creatures can't attack unless their controller sacrifices a land for each green creature they control that's attacking. ",
    "Black and/or red permanents and spells are colorless sources of damage.",
    "Black creatures can't attack unless their controller sacrifices a land for each black creature they control that's attacking. ",
    "White creatures have plainswalk. ",
    "Whenever a creature dies, you may pay {3}. If you do, draw a card.",
    "{1}{W}: Target creature gains first strike until end of turn.",
    "{1}{W}: Target nonattacking, nonblocking creature gets +0/+2 until end of turn.",
    "{2}{U}{U}: Look at the top five cards of your library, put one of them into your hand, and exile the rest.",
    "Cumulative upkeep {2} \nPay 2 life or {2}: Counter target red or green spell. Any player may activate this ability.",
    "Cumulative upkeep—Pay 1 life. \nAt the beginning of each player's upkeep, that player sacrifices a green or white permanent.",
    "{G}{W}, Discard a card: Put a +1/+1 counter on target creature or that creature gains banding, first strike, or trample. ",
    "Lands you control are Plains.\nNonland permanents you control are white. The same is true for spells you control and nonland cards you own that aren't on the battlefield.\nYou may spend white mana as though it were mana of any color. You may spend other mana only as though it were colorless mana.",
    "If you would draw a card, return a card from your graveyard to your hand instead. If you can't, you lose the game.\nIf a card would be put into your graveyard from anywhere, exile that card instead.",
    "Exile a card from your hand: Add {B}{B} or {G}{G}.",
    "{1}, Sacrifice a creature: The next time a source of your choice would deal damage to any target this turn, prevent that damage.",
    "Whenever a nontoken creature is put into your graveyard from the battlefield, exile that card.\nAt the beginning of your upkeep, you may pay {4} and 2 life. If you do, return a card exiled with Purgatory to the battlefield.",
    "Whenever an opponent casts a spell that targets you or a creature you control, you may draw a card.",
    "Pay 1 life: Until your next upkeep, target permanent can't phase out.",
    "{1}, Pay 1 life: Draw a card, then discard a card.",
    "At the beginning of your upkeep, for each land target player controls in excess of the number you control, choose a land that player controls, then the chosen permanents phase out. Repeat this process for artifacts and creatures. ",
    "You may cast Parapet as though it had flash. If you cast it any time a sorcery couldn't have been cast, the controller of the permanent it becomes sacrifices it at the beginning of the next cleanup step.\nCreatures you control get +0/+1.",
    "{W}, Pay 2 life: The next time a source of your choice would deal damage to you this turn, prevent that damage.",
    "Creatures don't untap during their controllers' untap steps.\nAt the beginning of each player's upkeep, that player may choose any number of tapped nongreen creatures they control and pay {2} for each creature chosen this way. If the player does, untap those creatures.",
    "{U}{U}, Return two Islands you control to their owner's hand: Return target creature to its owner's hand.",
    "Each land is a Swamp in addition to its other land types.",
    "Cumulative upkeep {R} \nBlue creatures can't block creatures you control.\nNonblue creatures can't block creatures you control unless their controller pays 1 life for each blocking creature they control.",
    "Players can cast spells and activate abilities only during their own turns.",
    "Cumulative upkeep {1} \nBlack creatures can't attack you.\nNonblack creatures can't attack you unless their controller pays {2} for each creature they control that's attacking you.",
    "Phasing \nCreatures with flying can't attack or block, and their activated abilities with {T} in their costs can't be activated.",
    "Reveal the first card you draw each turn. Whenever you reveal a basic land card this way, draw a card.",
    "If a player would draw a card, instead they draw a card and reveal it. If it's a creature card, that player discards it unless they pay 3 life.",
    "Cumulative upkeep {1} \nAt the beginning of your upkeep, put a rust counter on each artifact target opponent controls. Then destroy each artifact with mana value less than or equal to the number of rust counters on it. Artifacts destroyed this way can't be regenerated.\nWhen Corrosion leaves the battlefield, remove all rust counters from all permanents.",
    "White creatures you control have protection from black.\nBlack creatures you control have protection from white.",
    "Sacrifice a land: Add one mana of any type the sacrificed land could produce.",
    "{1}, Exile the top card of your graveyard: Prevent the next 1 damage that would be dealt to target creature this turn.",
    "Cumulative upkeep—Pay 2 life. \nPrevent all damage that would be dealt to creatures you control.",
    "At the beginning of your upkeep, destroy all artifacts and enchantments. They can't be regenerated.",
    "Creatures you control have vigilance. ",
    "All creatures have \"At the beginning of your upkeep, sacrifice this creature unless you pay {1}.\"",
    "Cumulative upkeep—Draw a card. \nAt the beginning of your end step, sacrifice a land and discard your hand.",
    "Whenever a creature you control attacks, it phases out at end of combat. ",
    "{2}, Sacrifice a nontoken permanent: Draw a card.",
    "{B}{B}, Pay 2 life, Sacrifice a Swamp: Return target creature card from your graveyard to the battlefield.",
    "Creatures you control have haste. ",
    "At end of combat, destroy each creature that blocked or was blocked this turn.",
    "{2}{G}{G}: Reveal the top card of your library. If it's a creature card, put it onto the battlefield. Otherwise, put it into your graveyard.",
    "Creatures can't be the targets of spells.",
    "Each creature you control can't be blocked by more than one creature.",
    "{1}{G}{G}: Destroy all other enchantments.",
    "{1}: The next time a creature of your choice with shadow would deal damage to you this turn, prevent that damage.",
    "Whenever a nontoken creature is put into your graveyard from the battlefield, create a 1/1 white Spirit creature token with flying.",
    "{2}{W}: Creatures you control get +1/+1 until end of turn.",
    "All artifacts have shroud. ",
    "All creatures lose all abilities and have base power and toughness 1/1.",
    "Black creatures can't attack or block.",
    "Whenever one or more creatures attack you, you gain 1 life for each attacking creature.",
    "{2}, Discard a card: Create a 1/1 white Pegasus creature token with flying.",
    "{2}{W}: Prevent all combat damage that would be dealt by target creature this turn.",
    "Whenever an opponent casts a red spell, you gain 2 life.",
    "Red spells cost {2} more to cast.",
    "Whenever an opponent casts a green spell, you draw a card.",
    "At the beginning of your upkeep, you may look at the top card of target opponent's library. If you do, you may put that card on the bottom of that player's library.",
    "Creatures can't attack you unless their controller pays {2} for each creature they control that's attacking you.",
    "{B}{B}: Target creature gains shadow until end of turn. ",
    "Whenever a creature is dealt damage, destroy it. It can't be regenerated.",
    "White creatures get -1/-1.",
    "{2}{B}{B}: Put a -1/-1 counter on target creature.",
    "During combat, players can't cast instant spells or activate abilities that aren't mana abilities.",
    "Whenever an opponent casts a white spell, they lose 2 life.",
    "Whenever a creature becomes blocked by a creature with lesser power, destroy the blocking creature.\nWhenever a creature blocks a creature with lesser power, destroy the attacking creature.",
    "Sacrifice two creatures: Create a 3/1 red Beast creature token named Carnivore.",
    "Any player may cast creature spells with mana value 3 or less without paying their mana costs and as though they had flash.",
    "Islands don't untap during their controllers' untap steps.",
    "Tap an untapped creature you control: Untap target basic land.",
    "At the beginning of each player's first main phase, that player adds {G}{G}.",
    "At the beginning of your upkeep, you may look at the top three cards of your library, then put them back in any order.",
    "All lands are 2/2 creatures that are still lands.",
    "Skip your draw step.\nWhenever you play a card, draw a card.\nYour maximum hand size is two.",
    "{G}{G}: Tap target creature with flying.",
    "Whenever you cast a spell, you gain 1 life.",
    "Put a card from your hand on top of your library: Prevent all damage that would be dealt by target instant or sorcery spell this turn.",
    "Wall creatures can attack as though they didn't have defender.",
    "Whenever a spell or ability an opponent controls causes a land to be put into your graveyard from the battlefield, return that card to the battlefield.",
    "Rather than pay the mana cost for a spell, its controller may discard a card that shares a color with that spell.",
    "Creatures don't untap during their controllers' untap steps.\nWhenever a creature enters, untap all creatures.",
    "At the beginning of each player's upkeep, that player discards a card at random.",
    "Whenever a creature is put into your graveyard from the battlefield, put that card on top of your library.",
    "{B}, Discard a creature card: Return target creature card from your graveyard to your hand.",
    "{1}, Discard a card at random: Put a +1/+1 counter on target creature.",
    "All creatures block each combat if able.\nThe attacking player chooses how each creature blocks each combat.",
    "At the beginning of each upkeep, untap all creatures and lands.",
    "Whenever an opponent plays a land, you may put a land card from your hand onto the battlefield.",
    "{2}, Tap an untapped creature you control: You gain 2 life. Activate only as a sorcery.",
    "At the beginning of your upkeep, if you have 10 or less life, you gain 1 life.",
    "At the beginning of each player's upkeep, that player chooses target player who controls more lands than they do and is their opponent. The first player may search their library for a basic land card, put that card onto the battlefield, then shuffle.",
    "{W}, Discard a card: You gain 3 life.",
    "Put a card from your hand on top of your library: The next time a black or red source of your choice would deal damage this turn, prevent that damage.",
    "{0}: Remove target attacking creature you control from combat and untap it. ",
    "Whenever you cast a creature spell, you may pay {1}. If you do, return target creature to its owner's hand.",
    "Whenever a player casts a spell, that player returns a land they control to its owner's hand.",
    "Discard a card: You may tap or untap target artifact, creature, or land.",
    "At the beginning of each player's upkeep, that player chooses target player who has more cards in hand than they do and is their opponent. The first player may discard their hand and draw three cards.",
    "{2}{U}{U}: Draw a card.",
    "At the beginning of each player's upkeep, that player chooses target player whose graveyard has fewer creature cards in it than their graveyard does and is their opponent. The first player may return a creature card from their graveyard to their hand.",
    "Whenever you cast a creature spell, tap target creature.",
    "Whenever a creature enters, that creature's controller may have it deal damage equal to its power to any target of their choice.",
    "Sacrifice a Forest: Target attacking creature gets -3/-0 until end of turn.",
    "At the beginning of your end step, you may reveal your hand and put all land cards from it onto the battlefield. If you do, discard your hand.",
    "At the beginning of each player's upkeep, that player chooses target player who controls more creatures than they do and is their opponent. The first player may reveal cards from the top of their library until they reveal a creature card. If the first player does, that player puts that card onto the battlefield and all other cards revealed this way into their graveyard.",
    "Creatures that are enchanted can't attack or block.",
    "{G}, Discard a creature card: Search your library for a creature card, reveal that card, put it into your hand, then shuffle.",
    "All creatures have protection from black.",
    "All creatures have protection from red.",
    "Rather than the attacking player, you assign the combat damage of each creature attacking you. You can divide that creature's combat damage as you choose among any of the creatures blocking it.",
    "Whenever a nontoken creature you control dies, you may search your library for a card with the same name as that creature, reveal it, put it into your hand, then shuffle.",
    "{W}: The next time an artifact source of your choice would deal damage to you this turn, prevent that damage.\nCycling {2} ",
    "{W}: The next time a black source of your choice would deal damage to you this turn, prevent that damage.\nCycling {2} ",
    "{W}: The next time a blue source of your choice would deal damage to you this turn, prevent that damage.\nCycling {2} ",
    "{W}: The next time a green source of your choice would deal damage to you this turn, prevent that damage.\nCycling {2} ",
    "{W}: The next time a land source of your choice would deal damage to you this turn, prevent that damage.\nCycling {2} ",
    "{W}: The next time a red source of your choice would deal damage to you this turn, prevent that damage.\nCycling {2} ",
    "{W}: The next time a white source of your choice would deal damage to you this turn, prevent that damage.\nCycling {2} ",
    "If you control a creature, damage that would reduce your life total to less than 1 reduces it to 1 instead.",
    "Nonbasic lands don't untap during their controllers' untap steps.",
    "{1}{U}: Counter target red spell.",
    "Whenever a green creature dies, its controller discards a card.",
    "At the beginning of your upkeep, sacrifice Contamination unless you sacrifice a creature.\nIf a land is tapped for mana, it produces {B} instead of any other type and amount.",
    "All creatures are black.",
    "Whenever a player casts a spell, that player discards a card.",
    "Whenever another card is put into a graveyard from anywhere, exile that card.",
    "Whenever a creature enters, its controller sacrifices a creature or land.",
    "Whenever an opponent casts a white spell, that player loses 1 life and you gain 1 life.",
    "At the beginning of each player's end step, Antagonism deals 2 damage to that player unless one of their opponents was dealt damage this turn.",
    "Creatures can't block.",
    "At the beginning of your upkeep, Bulwark deals X damage to target opponent, where X is the number of cards in your hand minus the number of cards in that player's hand.",
    "{R}: You may put a creature card from your hand onto the battlefield. That creature gains haste. Sacrifice the creature at the beginning of the next end step.",
    "If a red spell would deal damage to a permanent or player, it deals that much damage plus 1 to that permanent or player instead.",
    "At the beginning of each of your main phases, if you haven't added mana with this ability this turn, you may add X mana of any one color, where X is the number of Islands target opponent controls.",
    "Creatures with flying get -2/-0.",
    "You may play an additional land on each of your turns.",
    "Whenever a creature dies, that creature's controller may draw a card.",
    "Sacrifice a creature: Draw cards equal to the sacrificed creature's power, then discard three cards.",
    "At the beginning of each player's upkeep, if that player controls more lands than each other player, the player creates a 1/1 green Saproling creature token.",
    "Creatures you control have \"Whenever this creature becomes blocked by a creature, this creature gets +1/+1 until end of turn.\"",
    "Whenever a Forest is tapped for mana, its controller adds an additional {G}.",
    "Creatures you control have first strike.",
    "Sacrifice a creature: The next time a source of your choice would deal damage to any target this turn, prevent that damage.",
    "Other enchantments have \"At the beginning of your upkeep, sacrifice this enchantment unless you pay {2}.\"",
    "Creatures you control have flying.",
    "Whenever a creature deals damage to you, destroy it.",
    "{1}{B}, Pay 2 life: Return target creature card from your graveyard to your hand.",
    "At the beginning of your upkeep, each opponent loses 1 life. You gain life equal to the life lost this way.",
    "{R}: Target creature gets +1/+0 until end of turn.",
    "Whenever a spell you've cast is countered, draw a card.",
    "Each other non-Aura enchantment is a creature in addition to its other types and has base power and base toughness each equal to its mana value.",
    "Whenever an opponent taps a Mountain for mana, you may gain 1 life.",
    "{1}{U}, Discard a card: Draw a card.",
    "Tap an untapped creature you control: Tap target artifact, creature, or land.",
    "{B}, Sacrifice a creature: Destroy target nonblack creature.",
    "Whenever a creature enters, you lose 1 life and add {B}.",
    "Skip your draw step.\nPay 1 life: Draw a card.",
    "Whenever a black card is put into an opponent's graveyard from anywhere, you may draw a card.",
    "At the beginning of your first main phase, mill three cards. Then you may pay {1} and 3 life. If you do, put a card from among those cards into your hand.",
    "Whenever an opponent casts a spell, you may reveal the top card of your library. If you do, you may cast that card without paying its mana cost if the two spells have the same mana value.",
    "At the beginning of your end step, if you control a creature, look at the top seven cards of your library. Then you may sacrifice a creature. If you do, you may put a creature card with mana value X or less from among those cards onto the battlefield, where X is 1 plus the sacrificed creature's mana value. Put the rest on the bottom of your library in a random order.",
    "Whenever you cast a creature spell with power 5 or greater, discover X, where X is that spell's mana value. ",
    "If one or more +1/+1 counters would be put on a creature you control, twice that many +1/+1 counters are put on that creature instead.",
    "At the beginning of your end step, choose one —\n• You gain 1 life.\n• Return target creature card with mana value 1 from your graveyard to the battlefield.",
    "Whenever a creature attacks you or a planeswalker you control, investigate. ",
    "At the beginning of your upkeep, scry 1.\nWhenever you discard a card, each opponent mills two cards. ",
    "{1}, Discard a card: Create a 0/3 blue Crab creature token.\nDelirium — Crabs you control get +1/+1 as long as there are four or more card types among cards in your graveyard.",
    "At the beginning of combat on your turn, target creature you control gets +2/+0 until end of turn.\nBasic landcycling {1}{R} ",
    "At the beginning of each end step, if you've cast both a creature spell and a noncreature spell this turn, create a Clue token, a Food token, and a Treasure token.",
    "Green creatures you control get +1/+1.\nWhenever a green creature you control enters, scry 1.",
    "You can't cast more than one spell each turn.\nWhenever you cast a spell, draw a card.",
    "Whenever you cast an enchantment spell, draw a card.",
    "Creatures you control get +1/+1.\nWhenever you tap a land for mana, add one mana of any type that land produced.",
    "If it's not your turn, you may exile a white card from your hand rather than pay this spell's mana cost.\nFlash\nCreatures you control get +1/+1.",
    "Whenever a creature you control becomes blocked, you may return it to its owner's hand.",
    "Play with the top card of your library revealed.\nYou may play lands and cast spells from the top of your library.",
    "Attacking creatures you control get +1/+0.",
    "Each land card in your hand has cycling {R}.\nCycling {2} ",
    "Discard a land card: Create a 2/2 green Bear creature token.",
    "Whenever you cast a permanent spell with a mana cost that contains {X}, double the value of X.\nWhenever you cast an instant or sorcery spell or activate an ability, if that spell's mana cost or that ability's activation cost contains {X}, copy that spell or ability. You may choose new targets for the copy."
]