[
    "Prevent the next 1 damage that would be dealt to any target this turn.\nDraw a card.",
    "Put target attacking creature on the bottom of its owner's library. Its controller gains life equal to its toughness.",
    "Destroy target enchantment.",
    "Prevent all combat damage that would be dealt this turn.",
    "Prevent all damage that black sources and red sources would deal this turn.",
    "You gain 3 life.\nDraw a card.",
    "Target blocking creature gets +7/+7 until end of turn.",
    "Destroy all enchantments.",
    "Creatures you control get +1/+1 until end of turn.",
    "Gain control of target Aura that's attached to a permanent. Attach it to another permanent it can enchant.",
    "Return target permanent to its owner's hand.",
    "Counter target spell.",
    "Tap all creatures without flying.",
    "Counter target spell. Look at the top four cards of your library, then put them back in any order.",
    "Return all creatures to their owners' hands.",
    "Counter target red or green spell.",
    "Return all artifacts target player owns to their hand.",
    "Change the text of target permanent by replacing all instances of one color word with another or one basic land type with another.",
    "Look at target player's hand.\nDraw a card.",
    "Until end of turn, if target player would draw a card, instead that player skips that draw and you draw a card.",
    "Counter target creature spell.",
    "Look at the top three cards of your library. Put one of those cards into your hand, one on top of your library, and one on the bottom of your library.",
    "End the turn. ",
    "Copy target instant or sorcery spell. You may choose new targets for the copy.",
    "You may tap or untap target artifact, creature, or land.\nDraw a card.",
    "Return target creature to its owner's hand.",
    "Target creature gets -1/-1 until end of turn.\nDraw a card.",
    "Destroy target nonartifact, nonblack creature. It can't be regenerated.",
    "Target creature gets +4/+0 until end of turn.",
    "Guerrilla Tactics deals 2 damage to any target.\nWhen a spell or ability an opponent controls causes you to discard Guerrilla Tactics, Guerrilla Tactics deals 4 damage to any target.",
    "Incinerate deals 3 damage to any target. A creature dealt damage this way can't be regenerated this turn.",
    "Shock deals 2 damage to any target.",
    "Change the target of target spell with a single target.",
    "Destroy target artifact.\nDraw a card.",
    "As an additional cost to cast this spell, sacrifice all creatures you control.\nSoulblast deals damage to any target equal to the total power of the sacrificed creatures.",
    "Target creature can't block this turn.\nDraw a card.",
    "Sudden Impact deals damage to target player equal to the number of cards in that player's hand.",
    "Target creature gets +1/+1 until end of turn.\nDraw a card.",
    "Target creature gets +3/+3 until end of turn.",
    "Target creature gets +7/+7 until end of turn.",
    "Destroy target artifact or enchantment.",
    "Choose up to two target permanent cards in your graveyard that were put there from the battlefield this turn. Return them to the battlefield tapped.",
    "Destroy target artifact or enchantment.",
    "Target creature you control gains protection from the color of your choice until end of turn. \nScry 1.",
    "Creatures you control get +2/+1 until end of turn.",
    "Target creature gets +2/+2 and gains lifelink until end of turn. ",
    "Create two 1/1 white Soldier creature tokens.",
    "Choose target spell or permanent that's red or green. Its owner puts it on the top or bottom of their library.",
    "Look at the top three cards of your library. Put one of them into your hand and the rest on the bottom of your library in any order.",
    "Target creature gets -4/-0 until end of turn.\nDraw a card.",
    "Counter target creature spell.\nDraw a card.",
    "Counter target spell unless its controller pays {4}.",
    "Choose one —\n• Create two 3/3 colorless Golem artifact creature tokens.\n• Choose target artifact you control. Each other artifact you control becomes a copy of that artifact until end of turn.",
    "Counter target noncreature spell.",
    "Counter target activated ability, triggered ability, or legendary spell.",
    "Return target creature to its owner's hand.",
    "Target creature gains deathtouch until end of turn.\nDraw a card.",
    "Target creature gets -2/-2 until end of turn.",
    "Destroy target creature.",
    "Destroy target creature or planeswalker that's green or white. You gain 1 life.",
    "Target creature gets +3/+2 until end of turn.",
    "When you next cast an instant spell, cast a sorcery spell, or activate a loyalty ability this turn, copy that spell or ability twice. You may choose new targets for the copies.",
    "Target creature gets +1/+1 and gains double strike until end of turn. ",
    "Target creature gets +3/+3 until end of turn. It gets an additional +2/+2 until end of turn for each card named Growth Cycle in your graveyard.",
    "Target creature gets +1/+1 until end of turn for each creature you control.",
    "Destroy target artifact or enchantment. You gain 3 life.",
    "Destroy target creature with flying.",
    "Return target creature or land card from a graveyard to its owner's hand. You gain 6 life.",
    "Search your library for up to two creature cards with different names, reveal them, put them into your hand, then shuffle.",
    "Draw a card if an opponent has cast a blue or black spell this turn. Spells you control can't be countered this turn. You and permanents you control gain hexproof from blue and from black until end of turn. ",
    "Target creature gets +2/+4 until end of turn.",
    "Target creature gets +1/+3 until end of turn.",
    "Target creature gets +4/+4 until end of turn.",
    "Target player sacrifices an attacking or blocking creature.",
    "Target creature gets +1/+1 until end of turn. Prevent all damage that would be dealt to it this turn. If it's renowned, untap it.",
    "Create four 2/2 white Knight creature tokens with vigilance.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, creatures you control gain indestructible until end of turn.",
    "Until end of turn, if a creature would enter and it wasn't cast, exile it instead.\nDraw a card.",
    "Target creature gets +2/+2 and gains flying until end of turn.",
    "Draw two cards. If you control no artifacts, discard a card.",
    "Counter target creature spell.\nDraw a card.",
    "Counter target spell unless its controller pays {3}.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, scry 2. ",
    "Counter target spell unless its controller pays {X}.",
    "Return target nonland permanent to its owner's hand.",
    "Attacking creatures get -2/-0 until end of turn.\nDraw a card.",
    "Counter target noncreature spell.",
    "Tap up to two target creatures.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, those creatures don't untap during their controllers' next untap steps.",
    "Until end of turn, target creature loses all abilities and becomes a blue Frog with base power and toughness 1/1.",
    "Destroy target non-Zombie creature. It can't be regenerated. Return up to one target Zombie card from your graveyard to your hand.",
    "Regenerate target creature. Draw a card. \nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, also regenerate each other creature you control.",
    "Target creature you control gets +1/+0 and gains deathtouch until end of turn. Whenever a creature dealt damage by that creature dies this turn, its controller loses 2 life. ",
    "Destroy target creature.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, you gain 2 life.",
    "Target creature gets +3/+1 until end of turn. Scry 1. ",
    "Target creature gets +1/+1 until end of turn for each creature you control.",
    "Put target card from your graveyard on top of your library.",
    "Target creature gets +4/+4 until end of turn.",
    "Prevent all combat damage that would be dealt this turn by creatures with power 4 or less.",
    "Destroy target attacking or blocking creature.",
    "Draw two cards.",
    "Destroy target creature. It can't be regenerated.",
    "Destroy target creature with flying.",
    "Choose one —\n• You gain 5 life.\n• Prevent the next 5 damage that would be dealt to target creature this turn.\nEntwine {2} ",
    "Destroy all creatures that dealt damage to you this turn.",
    "Target creature gets +1/+1 until end of turn. Scry 2. ",
    "Destroy target blocking creature.",
    "Affinity for artifacts \nUntap all artifacts.",
    "Counter target spell unless its controller pays {X}. Scry 2. ",
    "Tap up to three target lands.",
    "Counter target spell. If that spell is countered this way, its controller may put a creature card from their hand onto the battlefield.",
    "Affinity for artifacts \nReturn target artifact to its owner's hand.",
    "Destroy target creature. It can't be regenerated. You lose life equal to that creature's toughness.",
    "Target creature gets -1/-1 until end of turn. Scry 2. ",
    "Choose one —\n• Destroy target artifact.\n• Destroy target land.\nEntwine {3}{R} ",
    "Target creature gets +4/+4 until end of turn. Scry 2. ",
    "Destroy target artifact. Scry 2. ",
    "Choose one —\n• Target creature you control gets +1/+2 until end of turn.\n• Return target creature you control to its owner's hand.",
    "Destroy target artifact or enchantment.\nRevolt — If a permanent you controlled left the battlefield this turn, you gain 3 life.",
    "Counter target spell, activated ability, or triggered ability. ",
    "Exile up to two target creatures you control, then return those cards to the battlefield under their owner's control.\nDraw a card.",
    "Return target nonland permanent to its owner's hand.\nDraw a card.",
    "Improvise \nCounter target spell unless its controller pays {3}.",
    "Counter target noncreature spell.",
    "Tap target creature. It doesn't untap during its controller's next untap step.",
    "Improvise \nSearch your library for an artifact card with mana value X or less, put it onto the battlefield, then shuffle.",
    "Target creature gets -2/-2 until end of turn. Scry 1. ",
    "Destroy target creature if it has mana value 2 or less.\nRevolt — Destroy that creature if it has mana value 4 or less instead if a permanent you controlled left the battlefield this turn.",
    "Each opponent sacrifices an artifact creature and a nonartifact creature.",
    "Target permanent gains indestructible until end of turn. Create a 1/1 colorless Servo artifact creature token. ",
    "Choose one —\n• Target creature gets +4/+0 and gains trample until end of turn.\n• Two target creatures each get +2/+0 and gain trample until end of turn.",
    "Target creature gets +1/+0 and gains first strike until end of turn.",
    "Permanents you control gain hexproof and indestructible until end of turn.",
    "Put X +1/+1 counters on target artifact you control. If it isn't a creature or Vehicle, it becomes a 0/0 Construct artifact creature.",
    "Put a +1/+1 counter on target creature, then put a +1/+1 counter on each creature you control with a +1/+1 counter on it.",
    "Put target artifact on the bottom of its owner's library.",
    "Attacking creatures get +2/+0 until end of turn.",
    "Blocking creatures get +0/+3 until end of turn.",
    "You gain X life, where X is twice the damage dealt to you so far this turn by artifacts.",
    "Return all artifacts target player owns to their hand.",
    "Counter target artifact spell.",
    "Destroy target artifact. It can't be regenerated. That artifact's controller gains life equal to its mana value.",
    "Choose one —\n• Target player gains X life.\n• Prevent the next X damage that would be dealt to any target this turn.",
    "Destroy target artifact. You gain life equal to its mana value.",
    "Choose target Wall creature. Whenever that creature is dealt damage by an attacking creature this turn, you gain that much life.",
    "Target creature gets +0/+X until end of turn, where X is its mana value.",
    "One or more target creatures become white until end of turn.",
    "Prevent all combat damage that would be dealt this turn.",
    "Prevent all damage that would be dealt to target creature this turn.",
    "Cast this spell only before blockers are declared.\nTarget creature gains first strike until end of turn. If it doesn't have rampage, that creature gains rampage 2 until end of turn. ",
    "Creatures you control get +0/+2 until end of turn.",
    "Return target permanent to its owner's hand.",
    "Attach target Aura attached to a creature or land to another permanent of that type.",
    "Counter target instant spell.",
    "Choose one —\n• Destroy target red permanent.\n• Return target Mountain to its owner's hand.",
    "Counter target spell unless its controller pays {1}.",
    "Counter target creature spell.",
    "Cast this spell only during an opponent's turn after their upkeep step.\nUntap all lands you control.",
    "All damage that would be dealt this turn by target sorcery spell is dealt to that spell's controller instead.",
    "One or more target creatures become blue until end of turn.",
    "Choose target creature. If a spell or ability that targets that creature would cause a source to deal damage to that creature this turn, prevent that damage.",
    "Tap target creature. Prevent all combat damage that would be dealt by that creature this turn. It doesn't untap during its controller's next two untap steps.",
    "Cast this spell only during the declare attackers step.\nTarget creature can't be blocked this turn.",
    "Prevent all combat damage that would be dealt this turn.",
    "Choose target Wall creature. At this turn's next end of combat, destroy all creatures that were blocked by that creature this turn.",
    "All creatures get -1/-0 until end of turn.",
    "One or more target creatures become black until end of turn.",
    "Switch target creature's power and toughness until end of turn.",
    "Choose one —\n• Destroy target blue permanent.\n• Return target Island to its owner's hand.",
    "Choose a player who cast one or more sorcery spells this turn. Backdraft deals damage to that player equal to half the damage dealt by one of those sorcery spells this turn, rounded down.",
    "If target creature has toughness 5 or greater, it gets +4/-4 until end of turn. Otherwise, it gets +4/-X until end of turn, where X is its toughness minus 1.",
    "Cast this spell only during combat before blockers are declared.\nUntap target attacking creature and remove it from combat. Gain control of that creature until end of turn.",
    "One or more target creatures become red until end of turn.",
    "Tap all creatures blocking target attacking creature. Prevent all combat damage that would be dealt this turn by that creature and each creature blocking it.",
    "Target blocking Wall you control gets +10/+0 until end of combat. Prevent all damage that would be dealt to it this turn. Destroy it at the beginning of the next end step.",
    "Counter target instant or Aura spell that targets a permanent you control.",
    "Choose target creature. When that creature dies this turn, return a creature card from its owner's graveyard to the battlefield under the control of that creature's owner.",
    "Counter target activated ability from an artifact source. ",
    "Prevent all combat damage that would be dealt by target creature this turn. That creature gets +0/+X until end of turn, where X is its mana value.",
    "One or more target creatures become green until end of turn.",
    "Until end of turn, if damage would be dealt to any creature, you may have that damage dealt to you instead.",
    "Cast this spell only during an opponent's upkeep.\nCreatures can't attack this turn.",
    "Nonwhite creatures get -1/-1 until end of turn.",
    "Attacking creatures get +1/+1 until end of turn.",
    "Tap all blue creatures.",
    "All creatures get -2/-0 until end of turn.",
    "Destroy target creature or land. It can't be regenerated.",
    "Until end of turn, whenever a player taps an Island for mana, that player adds an additional {U}.",
    "Tap all blocking creatures. Prevent all combat damage that would be dealt this turn. Each attacking creature and each blocking creature doesn't untap during its controller's next untap step.",
    "Untap all white creatures you control.\nWhenever a creature blocks this turn, it gets +0/+1 until end of turn.",
    "You gain 1 life.\nDraw a card at the beginning of the next turn's upkeep.",
    "Regenerate target creature.",
    "Destroy target artifact or enchantment.",
    "Target creature gains banding until end of turn. \nDraw a card at the beginning of the next turn's upkeep.",
    "Prevent the next 1 damage that would be dealt to any target this turn.\nDraw a card at the beginning of the next turn's upkeep.",
    "Target creature gains first strike until end of turn.\nDraw a card at the beginning of the next turn's upkeep.",
    "Blocking creatures get +1/+1 until end of turn.",
    "Prevent the next 3 damage that would be dealt to target creature this turn. At the beginning of the next end step, put a +0/+1 counter on that creature for each 1 damage prevented this way.",
    "Exile target creature. Its controller gains life equal to its power.",
    "Prevent all combat damage that would be dealt by target attacking creature this turn.",
    "Draw three cards, then put two cards from your hand on top of your library in any order.",
    "Look at target player's hand.\nDraw a card at the beginning of the next turn's upkeep.",
    "Counter target spell.",
    "Change the target of target spell with a single target.",
    "Tap target artifact, creature, or land.\nDraw a card at the beginning of the next turn's upkeep.",
    "Counter target spell unless its controller pays {1}.\nDraw a card at the beginning of the next turn's upkeep.",
    "Choose one —\n• Counter target spell if it's red.\n• Destroy target permanent if it's red.",
    "Untap target artifact, creature, or land.\nDraw a card at the beginning of the next turn's upkeep.",
    "Counter target spell unless its controller pays {X}. If that player doesn't, they tap all lands with mana abilities they control and lose all unspent mana.",
    "Untap target creature an opponent controls and gain control of it until end of turn. That creature gains haste until end of turn. When you lose control of the creature, tap it.",
    "Target player mills a card.\nDraw a card at the beginning of the next turn's upkeep.",
    "Change the text of target spell or permanent by replacing all instances of one color word with another. ",
    "Target creature gains flying until end of turn.\nDraw a card at the beginning of the next turn's upkeep.",
    "Return target creature and all white Auras you own attached to it to their owners' hands.",
    "As an additional cost to cast this spell, sacrifice a creature.\nAdd X mana in any combination of {B} and/or {R}, where X is the sacrificed creature's mana value.",
    "Destroy target nonblack creature. It can't be regenerated.",
    "Add {B}{B}{B}.",
    "Choose a card name. Exile the top six cards of your library, then reveal cards from the top of your library until you reveal a card with the chosen name. Put that card into your hand and exile all other cards revealed this way.",
    "Target creature can't be regenerated this turn.\nDraw a card at the beginning of the next turn's upkeep.",
    "Target creature gets +X/+0 until end of turn.",
    "Add {B} for each creature card in your graveyard.",
    "Green creatures you control get +1/+1 until end of turn.\nNongreen creatures you control get +1/+0 until end of turn.",
    "Cast this spell only during combat before blockers are declared.\nTarget creature can't block this turn.\nDraw a card at the beginning of the next turn's upkeep.",
    "Choose one —\n• Counter target spell if it's blue.\n• Destroy target permanent if it's blue.",
    "Destroy target artifact.",
    "Target creature gets +3/+0 and gains trample until end of turn.",
    "Untap target attacking creature. Prevent all combat damage that would be dealt to and dealt by that creature this turn.\nDraw a card at the beginning of the next turn's upkeep.",
    "Target creature gets +3/+3 until end of turn.",
    "Attacking creatures get +1/+0 and gain trample until end of turn.",
    "Until end of turn, target creature gains haste and \"{0}: Untap this creature. Activate only once.\"\nDraw a card at the beginning of the next turn's upkeep.",
    "Target creature can't be blocked this turn.",
    "Choose target creature. At this turn's next end of combat, destroy all creatures that blocked or were blocked by it this turn.",
    "Destroy target creature unless its controller pays life equal to its toughness. A creature destroyed this way can't be regenerated.",
    "Each player may draw up to two cards. For each card less than two a player draws this way, that player gains 2 life.",
    "You may tap or untap target creature. Then that creature's controller may pay {2}{U}. If the player does, they may copy this spell and may choose a new target for that copy.",
    "Target land becomes the basic land type of your choice until end of turn.\nDraw a card at the beginning of the next turn's upkeep.",
    "Counter target spell. If that spell is countered this way, put it on top of its owner's library instead of into that player's graveyard.",
    "Exile target card from a graveyard.\nDraw a card at the beginning of the next turn's upkeep.",
    "Target blocking creature gets +3/+1 until end of turn.",
    "Blocking creatures gain first strike until end of turn.",
    "Target creature gets -5/-0 until end of turn.",
    "Create a 1/1 white Knight creature token with banding. ",
    "Exile target nonwhite attacking creature. You gain life equal to its toughness.",
    "Until end of turn, target creature you control gains \"{0}: The next 1 damage that would be dealt to target creature, planeswalker, or player this turn is dealt to this creature instead.\" Only you may activate this ability.",
    "Put up to three target creature cards from your graveyard on top of your library.",
    "Destroy target creature with power 4 or greater. It can't be regenerated.",
    "Counter target spell. Its controller may draw up to two cards at the beginning of the next turn's upkeep.\nYou draw a card at the beginning of the next turn's upkeep.",
    "You may pay 1 life and exile a blue card from your hand rather than pay this spell's mana cost.\nCounter target spell.",
    "Shuffle a card from your hand into your library. If you do, draw two cards at the beginning of the next turn's upkeep.",
    "You may pay 1 life and exile a black card from your hand rather than pay this spell's mana cost.\nDistribute two -2/-1 counters among one or two target creatures.",
    "Choose one —\n• Create a 2/2 black Zombie creature token.\n• Destroy target nonartifact, nonblack creature. It can't be regenerated.",
    "Target creature gets +2/+0 until end of turn.\nDraw a card at the beginning of the next turn's upkeep.",
    "Put up to three target cards from an opponent's graveyard on top of their library in any order.",
    "Nonartifact creatures get -1/-1 until end of turn.",
    "Counter target instant spell if it's blue.\nDraw a card at the beginning of the next turn's upkeep.",
    "Cast this spell only during combat before blockers are declared.\nAll creatures gain menace until end of turn. \nDraw a card at the beginning of the next turn's upkeep.",
    "Return all Islands to their owners' hands. Each player sacrifices a Plains or a white permanent for each white permanent they control.",
    "As an additional cost to cast this spell, you may pay {2}{R}.\nPrevent all combat damage that would be dealt this turn. If this spell's additional cost was paid, this effect doesn't affect combat damage that would be dealt by red creatures.",
    "Untap any number of target creatures. Prevent all combat damage that would be dealt to and dealt by those creatures this turn.",
    "As an additional cost to cast this spell, discard a red or green card.\nTarget creature gains trample and gets +X/+0 until end of turn, where X is that creature's mana value.",
    "Destroy target creature. It can't be regenerated. Its controller creates a 1/1 white Spirit creature token with flying.",
    "Untap target nonattacking creature. It gets +1/+3 until end of turn.",
    "Cast this spell only during the declare blockers step.\nTarget unblocked attacking creature becomes blocked. \nDraw a card at the beginning of the next turn's upkeep.",
    "Put target artifact or enchantment on top of its owner's library.",
    "Destroy target artifact or enchantment.",
    "Destroy target artifact. You gain life equal to its mana value.",
    "Search your library for an artifact or enchantment card, reveal it, then shuffle and put that card on top.",
    "Choose one —\n• Target player gains 3 life.\n• Prevent the next 3 damage that would be dealt to any target this turn.",
    "Counter target artifact or enchantment spell. Its controller gains life equal to its mana value.",
    "Choose one —\n• All creatures get -2/-0 until end of turn.\n• Tap target creature.\n• Prevent the next 1 damage that would be dealt to any target this turn.",
    "Cast this spell only after combat.\nGain control of target nonartifact, nonblack creature that attacked you this turn and put a -1/-0 counter on it.",
    "The next time a source of your choice would deal damage to you and/or creatures you control this turn, prevent that damage. If damage from a black source is prevented this way, you gain that much life.",
    "Target creature defending player controls gets +3/+0 until end of turn. That creature can block up to two additional creatures this turn.",
    "Return target permanent to its owner's hand.",
    "Counter target spell. If that spell is countered this way, exile it instead of putting it into its owner's graveyard.",
    "Put target creature on top of its owner's library. If that creature is red, you may put it on the bottom of its owner's library instead.",
    "You may put a creature card from your hand onto the battlefield. If you do, sacrifice it unless you pay its mana cost reduced by {2}.",
    "You may tap or untap target artifact, creature, or land.\nDraw a card at the beginning of the next turn's upkeep.",
    "If target spell has only one target and that target is a creature, change that spell's target to another creature.",
    "Counter target spell. If that spell is countered this way, put it on top of its owner's library instead of into that player's graveyard.",
    "Change the text of target permanent by replacing all instances of one color word with another or one basic land type with another. ",
    "Search your library for an instant or sorcery card, reveal it, then shuffle and put that card on top.",
    "Counter target spell unless its controller pays {X}. If that player doesn't, they tap all lands with mana abilities they control and lose all unspent mana.",
    "Target permanent becomes the color or colors of your choice. ",
    "Untap target creature an opponent controls and gain control of it until end of turn. That creature gains haste until end of turn. When you lose control of the creature, tap it.",
    "Target artifact, creature, or land phases out. ",
    "Choose one —\n• Target player draws a card at the beginning of the next turn's upkeep.\n• Target creature gains flying until end of turn.\n• Target creature an opponent controls phases out. ",
    "Create a 5/5 blue Wall creature token with defender. Sacrifice it at the beginning of the next end step.",
    "Put any number of target creature cards from your graveyard on top of your library.\nDraw a card at the beginning of the next turn's upkeep.",
    "As an additional cost to cast this spell, sacrifice a creature.\nCreate X 0/1 black Insect creature tokens, where X is the sacrificed creature's power.",
    "Destroy target nonblack creature. It can't be regenerated.",
    "Add {B}{B}{B}.",
    "Choose one —\n• Target opponent loses 1 life and you gain 1 life.\n• Exile up to three target cards from a single graveyard.\n• Target creature gains fear until end of turn. ",
    "Black creatures get +2/+0 until end of turn.",
    "Return the top creature card of your graveyard to the battlefield. That creature gains haste until end of turn. Exile it at the beginning of the next end step.",
    "Destroy target creature if it's white. A creature destroyed this way can't be regenerated.\nDraw a card at the beginning of the next turn's upkeep.",
    "Target creature you control gets +X/+0 until end of turn, where X is the number of creature cards in your graveyard. Sacrifice that creature at the beginning of the next end step.",
    "As an additional cost to cast this spell, pay 3 life.\nCounter target creature spell.",
    "Cast this spell only during combat after blockers are declared.\nFlip a coin. If you win the flip, target creature gets +1/+1 until end of turn.\nDraw a card at the beginning of the next turn's upkeep.",
    "Target creature gains trample until end of turn. When that creature becomes blocked this turn, it gets +1/+1 until end of turn for each creature blocking it.",
    "All creatures lose trample until end of turn. If a creature would deal combat damage to a creature this turn, it deals double that damage to that creature instead.",
    "Take an extra turn after this one. At the beginning of that turn's end step, you lose the game.",
    "Target player reveals their hand. For each blue instant card revealed this way, that player discards that card unless they pay 4 life.",
    "Exile target permanent you own or control.\nDraw a card at the beginning of the next turn's upkeep.",
    "Target player untaps all basic lands they control.",
    "Prevent all combat damage that would be dealt this turn.",
    "Cast this spell only if an opponent cast a creature spell this turn.\nYou may put a green creature card from your hand onto the battlefield.",
    "Choose one —\n• Return target Aura attached to a creature to its owner's hand.\n• Regenerate target green creature.\n• Target creature gains trample until end of turn.",
    "Destroy all Auras.",
    "Destroy all non-Aura enchantments.",
    "Search your library for a creature card, reveal it, then shuffle and put the card on top.",
    "Cast this spell only during an opponent's turn.\nTap target creature that player controls. That creature deals damage equal to its power to the player. Prevent all combat damage that would be dealt to and dealt by the creature this turn.",
    "Choose a color. X target creatures gain protection from the chosen color until end of turn.",
    "The next time a source of your choice would deal damage this turn, that damage is dealt to that source's controller instead.",
    "You gain X plus 3 life.",
    "The next time a source of your choice would deal damage to any target this turn, prevent that damage. If damage from a red source is prevented this way, Honorable Passage deals that much damage to the source's controller.",
    "Choose one —\n• Target creature gains first strike until end of turn.\n• Target player gains 2 life.\n• Destroy target Aura.",
    "Return target creature card from your graveyard to the battlefield. Put a +1/+1 counter on it.",
    "Prevent the next 5 damage that would be dealt this turn to any number of targets, divided as you choose.",
    "Search your library for a Plains card. If target opponent controls more lands than you, you may search your library for an additional Plains card. Reveal those cards, put them into your hand, then shuffle.",
    "Creatures you control get +1/+1 until end of turn.",
    "Counter target spell. If an artifact or creature spell is countered this way, put that card onto the battlefield under your control instead of into its owner's graveyard.",
    "Choose a card name, then target opponent mills a card. If a card with the chosen name was milled this way, you draw a card.\nDraw a card at the beginning of the next turn's upkeep.",
    "Look at the top four cards of your library. Put one of them into your hand and the rest on the bottom of your library in any order.",
    "Target player draws two cards.",
    "Exile the top three cards of your library face down. You may look at those cards for as long as they remain exiled. Until your next turn, you may play those cards. At the beginning of your next upkeep, put any of those cards you didn't play into your graveyard.",
    "Simultaneously, all phased-out creatures phase in and all creatures with phasing phase out.",
    "Choose one —\n• Target player mills four cards.\n• Choose a land type and a basic land type. Each land of the first chosen type becomes the second chosen type until end of turn.\n• Target artifact phases out. ",
    "Choose one —\n• Target player discards a card.\n• Target creature gets +2/-1 until end of turn.\n• Target creature gains swampwalk until end of turn. ",
    "As an additional cost to cast this spell, sacrifice all permanents you control and discard your hand.\nTarget player loses 5 life.",
    "Search your library for a card, then shuffle and put that card on top. You lose 2 life.",
    "As an additional cost to cast this spell, sacrifice a creature.\nTarget creature gets +4/+2 until end of turn.",
    "Choose one —\n• Destroy target artifact creature.\n• Attacking creatures get +1/+0 until end of turn.\n• Target creature with power 2 or less can't be blocked this turn.",
    "Target player can't play lands this turn.\nDraw a card at the beginning of the next turn's upkeep.",
    "Choose one —\n• Untap target permanent.\n• Destroy target non-Aura enchantment.\n• Target creature loses flying until end of turn.",
    "Target creature gets +1/+1 until end of turn.\nDraw a card at the beginning of the next turn's upkeep.",
    "Attacking creatures with flying get -2/-2 and lose flying until end of turn.",
    "Until end of turn, target player can't cast instant or sorcery spells, and that player can't activate abilities that aren't mana abilities.\nDraw a card.",
    "Return target artifact or enchantment card from your graveyard to your hand.",
    "Regenerate target creature. You gain control of that creature if it regenerates this way.",
    "Target creature gets +1/+0 and gains first strike until end of turn.\nDraw a card.",
    "As an additional cost to cast this spell, sacrifice a blue permanent.\nCounter target spell.",
    "Counter target instant or sorcery spell unless its controller pays {1}.\nDraw a card.",
    "Destroy target creature that was dealt damage this turn. It can't be regenerated.",
    "Target opponent sacrifices a creature for each creature put into your graveyard from the battlefield this turn.",
    "Target creature attacks this turn if able.\nDraw a card.",
    "Choose a source you control and flip a coin. If you win the flip, the next time that source would deal damage this turn, it deals double that damage instead. If you lose the flip, the next time it would deal damage this turn, prevent that damage.",
    "You gain life equal to the number of creature cards in your graveyard.",
    "Untap all creatures you control.",
    "Buyback {3} \nPrevent the next 3 damage that would be dealt to target creature this turn.",
    "Destroy target artifact or enchantment.",
    "Target blocking creature gets +4/+4 until end of turn.\nDraw a card.",
    "Buyback {3} \nThe next time a source of your choice would deal damage to you this turn, prevent that damage.",
    "Destroy target enchantment. You gain life equal to its mana value.",
    "Buyback {2} \nAs an additional cost to cast this spell, sacrifice a creature.\nYou gain life equal to the sacrificed creature's toughness.",
    "Buyback {3} \nReturn target permanent to its owner's hand.",
    "Counter target spell.",
    "Counter target spell.\nDraw a card.",
    "Counter target activated ability from an artifact, creature, enchantment, or land. That permanent's activated abilities can't be activated this turn. \nDraw a card.",
    "Search your library for three cards and reveal them. Target opponent chooses one. Put that card into your hand and the rest into your graveyard. Then shuffle.",
    "Draw four cards. You skip your next turn.",
    "Counter target spell unless its controller pays {X}. If that player doesn't, they tap all lands with mana abilities they control and lose all unspent mana.",
    "Target creature gains shadow until end of turn. \nDraw a card.",
    "Counter target spell with mana value X. ",
    "You may tap or untap target artifact, creature, or land.\nDraw a card.",
    "Buyback {2} \nChange the text of target permanent by replacing all instances of one color word with another or one basic land type with another until end of turn. ",
    "Buyback {5} \nDraw a card.",
    "Buyback {2} \nReturn the top creature card of your graveyard to the battlefield. That creature gains haste until end of turn. Exile it at the beginning of the next end step.",
    "Destroy target nonblack creature. It can't be regenerated.",
    "Add {B}{B}{B}.",
    "Target player sacrifices a creature.",
    "Buyback {3} \nTarget creature attacks this turn if able.",
    "Destroy two target nonblack creatures. You lose 5 life.",
    "Cast this spell only before the combat damage step.\nTarget attacking or blocking creature gets +4/+0 until end of turn. Destroy that creature at the beginning of the next end step.",
    "Destroy all Islands.",
    "Destroy target artifact.",
    "Target creature can't block this turn.\nDraw a card.",
    "Buyback {4} \nTarget creature gets +2/+2 until end of turn.",
    "As an additional cost to cast this spell, sacrifice a land.\nSearch your library for up to two basic land cards, put them onto the battlefield, then shuffle.",
    "Target creature loses shadow until end of turn.\nDraw a card.",
    "Return up to X target cards from your graveyard to your hand, where X is the number of black permanents target opponent controls as you cast this spell.",
    "Prevent all combat damage that would be dealt this turn. You gain 1 life for each attacking creature.",
    "Destroy target artifact.",
    "Prevent the next 1 damage that would be dealt to any target this turn.\nDraw a card.",
    "Buyback {3} \nTarget creature can't attack this turn.",
    "As an additional cost to cast this spell, sacrifice a creature.\nReturn any number of target creatures you control to their owner's hand.",
    "Destroy target blocked creature.",
    "Prevent the next X damage that would be dealt to target creature this turn. For each 1 damage prevented this way, put a +1/+1 counter on that creature.",
    "Return all creatures to their owners' hands.",
    "Target creature gains flying until end of turn.\nDraw a card.",
    "Counter target spell unless its controller pays {3}.",
    "As an additional cost to cast this spell, sacrifice a creature.\nSearch your library for a card with the same name as target nontoken creature, put that card onto the battlefield, then shuffle.",
    "Buyback {2}{U} \nTap target artifact, creature, or land.",
    "Change the target of target spell that targets only a player. The new target must be a player.",
    "Untap all creatures you control and all creatures target opponent controls. You and that opponent each gain control of all creatures the other controls until end of turn. Those creatures gain haste until end of turn.",
    "As an additional cost to cast this spell, sacrifice a creature.\nFling deals damage equal to the sacrificed creature's power to any target.",
    "Buyback—Sacrifice a land. \nPrevent all combat damage that would be dealt this turn.",
    "Creatures you control gain reach until end of turn. ",
    "Untap target creature you don't control. That creature blocks this turn if able.\nDraw a card.",
    "Buyback {3} \nDestroy target enchantment.",
    "All damage that would be dealt this turn to target creature you control by a source of your choice is dealt to another target creature instead.",
    "Buyback—Sacrifice a land. \nYou gain 2 life.",
    "Buyback—Discard two cards. \nCounter target spell.",
    "As an additional cost to cast this spell, sacrifice a creature.\nAdd {B}{B}{B}{B}.",
    "As an additional cost to cast this spell, pay X life.\nTarget creature gets +X/+0 until end of turn.",
    "Cast this spell only during your end step.\nAs an additional cost to cast this spell, pay X life.\nDraw X cards.",
    "Creatures you control get +1/+0 until end of turn.",
    "Buyback—Pay 4 life. \nDestroy target nonblack creature. It can't be regenerated.",
    "For each blocking creature, flip a coin. If you win the flip, prevent all combat damage that would be dealt by that creature this turn.",
    "Buyback {3} \nDestroy target artifact.",
    "Put target card from your graveyard on top of your library.",
    "Until end of turn, creatures you control gain \"{1}: Regenerate this creature.\"",
    "Destroy target enchantment.\nCycling {2} ",
    "Target player gains 2 life for each creature on the battlefield.",
    "Destroy target artifact or enchantment.",
    "Choose one —\n• Target player gains 3 life.\n• Prevent the next 3 damage that would be dealt to any target this turn.",
    "Until end of turn, target creature loses all abilities and has base power and toughness 0/1.",
    "Prevent all damage that would be dealt this turn to up to two target creatures.",
    "Create three 2/2 white Knight creature tokens. Exile them at the beginning of the next cleanup step.",
    "Counter target artifact or enchantment spell.",
    "Draw two cards, then discard a card.",
    "Each player returns a creature they control to its owner's hand.",
    "Attach target Aura attached to a creature or land to another permanent of that type.",
    "Return all green permanents to their owners' hands.",
    "Counter target spell unless its controller pays {X}. If that player doesn't, they tap all lands with mana abilities they control and lose all unspent mana.",
    "Return target permanent to its owner's hand.\nCycling {2} ",
    "Counter target spell. Untap up to four lands.",
    "Target player draws X cards.",
    "Return all lands to their owners' hands.",
    "Discard all the cards in your hand, then draw that many cards.",
    "Choose artifact, creature, or land. Tap all untapped permanents of the chosen type target player controls, or untap all tapped permanents of that type that player controls.",
    "Target creature gets +2/+0 and gains fear until end of turn. ",
    "Add {B}{B}{B}.",
    "Destroy target nonartifact, nonblack creature. It can't be regenerated.\nCycling {2} ",
    "Until end of turn, lands you control gain \"Sacrifice this land: Add {B}.\"",
    "Gain control of all permanents you own. \nCycling {2} ",
    "Creatures without flying can't block this turn.",
    "Attacking creatures gain first strike until end of turn.",
    "X target blocked creatures assign their combat damage this turn as though they weren't blocked.",
    "Destroy target artifact.\nCycling {2} ",
    "Prevent all combat damage that would be dealt this turn.\nCycling {2} ",
    "Two target creatures each get +2/+2 until end of turn.",
    "You gain 3 life for each creature attacking you.",
    "Untap target permanent.",
    "Exile target enchantment.",
    "Untap two target creatures. Each of them gets +1/+1 until end of turn.",
    "Target creature gets +0/+4 until end of turn.\nCycling {2} ",
    "Destroy two target enchantments.",
    "Destroy target creature with power 4 or greater.\nCycling {2} ",
    "Draw two cards, then discard two cards. Untap up to three lands.",
    "Counter target spell that targets a creature.",
    "Counter target spell unless its controller pays {2}.\nCycling {2} ",
    "Target player draws four cards.",
    "Return all artifacts to their owners' hands.\nCycling {2} ",
    "Return target creature to its owner's hand. Untap up to two lands.",
    "Two target creatures each get -1/-1 until end of turn.",
    "Destroy target creature with power 2 or less.\nCycling {2} ",
    "Switch target creature's power and toughness until end of turn.",
    "Destroy two target artifacts.",
    "As an additional cost to cast this spell, sacrifice a land.\nSearch your library for a land card, put that card onto the battlefield, then shuffle.",
    "Put all enchantments on top of their owners' libraries.",
    "Target creature gets +7/+7 until end of turn.",
    "Shuffle all creature cards from target player's graveyard into that player's library.\nCycling {2} ",
    "Target creature gets +1/+1 and gains reach until end of turn. ",
    "Prevent all combat damage that would be dealt by target creature this turn.\nCycling {2} ",
    "Reveal any number of white cards in your hand. You gain 2 life for each card revealed this way.",
    "Exile target enchantment. Search its controller's graveyard, hand, and library for all cards with the same name as that enchantment and exile them. Then that player shuffles.",
    "Creatures you control get +0/+5 until end of turn.",
    "Counter target instant or sorcery spell. Search its controller's graveyard, hand, and library for all cards with the same name as that spell and exile them. Then that player shuffles.",
    "Return target permanent you control to its owner's hand.",
    "Reveal any number of blue cards in your hand. Counter target spell unless its controller pays {1} for each card revealed this way.",
    "Exile up to three target cards from a single graveyard.\nCycling {2} ",
    "Reveal any number of black cards in your hand. Target creature gets -X/-X until end of turn, where X is the number of cards revealed this way.",
    "Attacking creatures get +2/+0 until end of turn.",
    "All creatures get +1/+1 until end of turn.",
    "Reveal any number of green cards in your hand. Target creature gets +X/+X until end of turn, where X is the number of cards revealed this way.",
    "Choose one —\n• Counter target multicolored spell.\n• Destroy target multicolored permanent.",
    "You may sacrifice a nontoken white creature rather than pay this spell's mana cost.\nUntil end of turn, your life total can't change, and permanents you control gain hexproof and indestructible.",
    "Choose one —\n• Thraben Charm deals damage equal to twice the number of creatures you control to target creature.\n• Destroy target enchantment.\n• Exile any number of target players' graveyards.",
    "Target creature gets +2/+2 until end of turn. Put a flying counter on it. Scry 1.",
    "Draw four cards, then put two cards from your hand on top of your library in any order.",
    "Replicate {1} \nCounter target triggered ability or colorless spell.",
    "You may sacrifice a nontoken blue creature rather than pay this spell's mana cost.\nCounter target spell.",
    "Counter target artifact, creature, or planeswalker spell. Its controller creates a 2/2 blue Bird creature token with flying.",
    "Destroy target creature or planeswalker. You gain 1 life for each of its colors.",
    "Consuming Corruption deals X damage to target creature or planeswalker and you gain X life, where X is the number of Swamps you control.",
    "As an additional cost to cast this spell, sacrifice an artifact or creature.\nDraw two cards.\nFlashback {4}{B} ",
    "You may sacrifice a nontoken black creature rather than pay this spell's mana cost.\nEach opponent sacrifices a creature or planeswalker with the greatest mana value among creatures and planeswalkers they control.",
    "You may sacrifice a nontoken red creature rather than pay this spell's mana cost.\nCopy target instant or sorcery spell. You may choose new targets for the copy.",
    "Split second \nChoose one —\n• Destroy target artifact.\n• Target creature gets +3/+2 and gains trample until end of turn.",
    "Escalate {G} \nChoose one or more —\n• Destroy target artifact.\n• Destroy target enchantment.\n• Target creature gains hexproof and indestructible until end of turn.",
    "Destroy target creature with flying.\nReinforce 2—{2}{G} ",
    "Put a +1/+1 counter, a reach counter, and a deathtouch counter on target creature. Untap it.",
    "Put a +1/+1 counter on target creature you control, then each modified creature you control deals damage equal to its power to target creature you don't control. ",
    "Devoid \nExile target nonland permanent. You may cast that card for as long as it remains exiled, and you may spend colorless mana as though it were mana of any color to cast that spell.",
    "Choose target spell, then flip a coin. If you win the flip, gain control of that spell and you may choose new targets for it. If you lose the flip, counter that spell.",
    "Look at the top four cards of your library. You may put a land card from among them onto the battlefield tapped. If you don't, put a card from among them into your hand. Put the rest on the bottom of your library in a random order.",
    "Return target spell or nonland permanent an opponent controls to its owner's hand.",
    "Destroy target creature or planeswalker.",
    "Until end of turn, double target creature's power and it gains first strike.",
    "Put a +1/+1 counter on target creature. It gains indestructible until end of turn.",
    "Search your library for an instant card or a card with flash, reveal it, put it into your hand, then shuffle.",
    "Kicker {W} \nTarget player can't cast spells this turn. If this spell was kicked, creatures can't attack this turn.",
    "You may sacrifice a nontoken white creature rather than pay this spell's mana cost.\nUntil end of turn, your life total can't change, and permanents you control gain hexproof and indestructible.",
    "Kicker {W} \nTarget player can't cast spells this turn. If this spell was kicked, creatures can't attack this turn.",
    "You may sacrifice a nontoken blue creature rather than pay this spell's mana cost.\nCounter target spell.",
    "Counter target artifact, creature, or planeswalker spell. Its controller creates a 2/2 blue Bird creature token with flying.",
    "You may sacrifice a nontoken black creature rather than pay this spell's mana cost.\nEach opponent sacrifices a creature or planeswalker with the greatest mana value among creatures and planeswalkers they control.",
    "You may sacrifice a nontoken red creature rather than pay this spell's mana cost.\nCopy target instant or sorcery spell. You may choose new targets for the copy.",
    "Devoid \nExile target nonland permanent. You may cast that card for as long as it remains exiled, and you may spend colorless mana as though it were mana of any color to cast that spell.",
    "Choose one —\n• Counter target multicolored spell.\n• Destroy target multicolored permanent.",
    "You may sacrifice a nontoken white creature rather than pay this spell's mana cost.\nUntil end of turn, your life total can't change, and permanents you control gain hexproof and indestructible.",
    "You may sacrifice a nontoken blue creature rather than pay this spell's mana cost.\nCounter target spell.",
    "You may sacrifice a nontoken black creature rather than pay this spell's mana cost.\nEach opponent sacrifices a creature or planeswalker with the greatest mana value among creatures and planeswalkers they control.",
    "You may sacrifice a nontoken red creature rather than pay this spell's mana cost.\nCopy target instant or sorcery spell. You may choose new targets for the copy.",
    "Choose target spell, then flip a coin. If you win the flip, gain control of that spell and you may choose new targets for it. If you lose the flip, counter that spell.",
    "Counter target instant or sorcery spell unless its controller pays {1}.\nStorm ",
    "Target permanent gains hexproof and indestructible until end of turn. If it's an artifact creature, it gets +2/+2 until end of turn.",
    "You gain hexproof until your next turn. You gain 2 life.\nRebound ",
    "Choose one —\n• Destroy target artifact.\n• Destroy target enchantment.\n• Exile target card from a graveyard.\nReinforce 1—{W} ",
    "Affinity for artifacts \nLens Flare deals 5 damage to target attacking or blocking creature.",
    "Choose one —\n• Put a +1/+1 counter on each of up to two target creatures.\n• Proliferate. \nEntwine {3}{W} ",
    "Replicate {U} \nCounter target spell unless its controller pays {2}.",
    "Draw three cards.\nBasic landcycling {1}{U} ",
    "Return target creature to its owner's hand. If you've discarded a card this turn, draw a card.",
    "Tap up to two target creatures. Those creatures don't untap during their controller's next untap step.",
    "Exile target creature and put two time counters on it. If it doesn't have suspend, it gains suspend. ",
    "Split second \nTarget player sacrifices a creature.",
    "Target creature gets -3/-3 until end of turn.\nHellbent — That creature gets -13/-13 until end of turn instead if you have no cards in hand.",
    "Gain control of target spell that targets only a single permanent or player. Copy it, then reselect the targets at random for the spell and the copy. The new targets can't be you or a permanent you control.",
    "Discard a card, then draw a card.\nRebound ",
    "Discard a card, then draw two cards.",
    "Target player shuffles their graveyard into their library. Prevent all combat damage that would be dealt this turn.",
    "Choose two —\n• Target player creates two tapped 1/1 green Squirrel creature tokens.\n• Counter target loyalty ability of a planeswalker.\n• Exile target card from a graveyard.\n• Target player gains 3 life.",
    "Draw two cards, then discard a card. You gain life equal to the number of cards you've discarded this turn.\nJump-start ",
    "Search your library for a basic land card, put it onto the battlefield tapped, then shuffle.",
    "Counter target spell.",
    "If an opponent controls an Island and you control a Mountain, you may cast this spell without paying its mana cost.\nDestroy target artifact.",
    "Create a 4/4 green Beast creature token.\nStorm ",
    "Tap target permanent.\nDraw a card.",
    "Counter target spell.",
    "You gain hexproof until your next turn. You gain 2 life.\nRebound ",
    "Split second \nTarget player sacrifices a creature.",
    "Discard a card, then draw a card.\nRebound ",
    "Choose two —\n• Target player creates two tapped 1/1 green Squirrel creature tokens.\n• Counter target loyalty ability of a planeswalker.\n• Exile target card from a graveyard.\n• Target player gains 3 life.",
    "Search your library for a basic land card, put it onto the battlefield tapped, then shuffle.",
    "Target permanent gains hexproof and indestructible until end of turn. If it's an artifact creature, it gets +2/+2 until end of turn.",
    "Exile target creature and put two time counters on it. If it doesn't have suspend, it gains suspend. ",
    "Gain control of target spell that targets only a single permanent or player. Copy it, then reselect the targets at random for the spell and the copy. The new targets can't be you or a permanent you control.",
    "Kicker {2}{U} \nDestroy target artifact or enchantment. If this spell was kicked, draw two cards.",
    "Exile target creature you control, then return it to the battlefield under its owner's control.\nRebound ",
    "Destroy target permanent. Its controller creates a 3/3 green Elephant creature token.",
    "You gain shroud until end of turn. \nCycling {2} ",
    "Buyback {3} \nCreate a 1/1 white Soldier creature token.",
    "Target creature you control gains protection from the color of your choice until end of turn.\nDraw a card.",
    "Target creature you control gets +2/+2 until end of turn.\nOverload {5}{W} ",
    "Target player sacrifices an attacking creature.\nStorm ",
    "Choose one —\n• Counter target spell.\n• Target player draws two cards.\n• Gain control of target nonland permanent with mana value 1 or less.",
    "Draw a card.\nSplice onto instant or sorcery {2}{U} ",
    "Counter target creature spell.\nDraw a card.",
    "Reveal the top five cards of your library. An opponent separates those cards into two piles. Put one pile into your hand and the other into your graveyard.",
    "If it's not your turn, you may exile a blue card from your hand rather than pay this spell's mana cost.\nCounter target noncreature spell. If that spell is countered this way, exile it instead of putting it into its owner's graveyard.",
    "Until end of turn, up to two target creatures each have base power and toughness 3/3, gain flying, and become blue Illusions in addition to their other colors and types.\nDraw a card.",
    "Kicker {2} \nCounter target spell if its mana value is 2 or less. If this spell was kicked, counter that spell if its mana value is 4 or less instead.",
    "Draw three cards, then discard a card.",
    "Return all artifacts to their owners' hands.\nCycling {2} ",
    "Counter target spell.\nFateful hour — If you have 5 or less life, draw a card.",
    "Return target creature to its owner's hand. Then that creature's controller may pay {U}{U}. If the player does, they may copy this spell and may choose a new target for that copy.",
    "Choose one —\n• Target creature gets -6/-0 until end of turn.\n• Switch target creature's power and toughness until end of turn.\nEntwine {B} ",
    "Target creature gets -1/-1 until end of turn for each Swamp you control.",
    "Target player sacrifices a creature.",
    "If it's not your turn, you may exile a black card from your hand rather than pay this spell's mana cost.\nDestroy all creatures that entered this turn.",
    "Convoke \nDestroy target creature.",
    "Choose one —\n• Target creature gets +2/+2 until end of turn.\n• Target creature gets -1/-1 until end of turn.\n• You gain 2 life.",
    "Draw a card. Until end of turn, target creature gains trample and gets +1/+0 for each card you've drawn this turn.",
    "If it's not your turn, you may exile a red card from your hand rather than pay this spell's mana cost.\nCreate two 3/1 red Elemental creature tokens with trample and haste. Sacrifice those tokens at the beginning of your next upkeep.",
    "Kicker {8}{R} \nThis spell can't be countered.\nUrza's Rage deals 3 damage to any target. If this spell was kicked, instead it deals 10 damage to that permanent or player and the damage can't be prevented.",
    "Until end of turn, creatures you control get +2/+0 and gain all creature types.",
    "Buyback {4} \nTarget creature gets +2/+2 until end of turn.",
    "If it's not your turn, you may exile a green card from your hand rather than pay this spell's mana cost.\nDestroy up to two target artifacts and/or enchantments.",
    "Destroy target creature with flying.\nCycling {1}{G} ",
    "You gain 3 life.\nStorm ",
    "Search your library for a creature card, reveal that card, put it into your hand, then shuffle.",
    "Choose two —\n• Each opponent sacrifices a creature.\n• Exile all opponents' graveyards.\n• Create a 1/1 white and black Spirit creature token with flying.\n• You gain 4 life.\nEntwine {3} ",
    "Destroy target artifact or enchantment.",
    "Counter target instant or sorcery spell unless its controller pays {1}.\nStorm "
]