[
    "Target creature gets +3/+3 and gains flying until end of turn. ",
    "Destroy all creatures. They can't be regenerated.",
    "Draw two cards.",
    "Target player shuffles their graveyard into their library.",
    "Draw three cards, then discard a card.",
    "Draw four cards.",
    "Target player takes two extra turns after this one.",
    "Target player mills half their library, rounded down.",
    "Look at target player's hand and choose two cards from it. Put them on top of that player's library in any order.",
    "Destroy target tapped creature.",
    "Target opponent sacrifices a creature.",
    "Destroy target green or white creature.",
    "Search your library for a card, put that card into your hand, then shuffle.",
    "Target player reveals their hand. You choose a nonland card from it. That player discards that card.",
    "Target opponent puts the cards from their hand on top of their library. Search that player's library for that many cards. The player puts those cards into their hand, then shuffles.",
    "Exile X target creature cards from your graveyard. For each creature card exiled this way, create a 2/2 black Zombie creature token.",
    "Target player discards two cards.",
    "Destroy all creatures you don't control. They can't be regenerated.",
    "Destroy target land.",
    "Return target creature card from your graveyard to your hand.\nDraw a card.",
    "Target player loses 4 life and you gain 4 life.",
    "Each player loses 1 life for each creature they control.",
    "Destroy target artifact or land.",
    "All creatures get +X/-X until end of turn.",
    "Draw four cards, then discard three cards at random.",
    "Untap all creatures that attacked this turn. After this main phase, there is an additional combat phase followed by an additional main phase.",
    "Destroy all artifacts. They can't be regenerated.",
    "Untap target creature and gain control of it until end of turn. That creature gains haste until end of turn. ",
    "Look at the top five cards of your library. You may reveal a creature card from among them and put it into your hand. Put the rest on the bottom of your library in any order.",
    "Destroy target artifact, enchantment, or land.",
    "Target player gains 8 life.",
    "Creatures you control get +3/+3 and gain trample until end of turn.",
    "Search your library for a basic land card, put that card onto the battlefield tapped, then shuffle.",
    "Return target card from your graveyard to your hand.",
    "Search your library for a land card, reveal it, put it into your hand, then shuffle.",
    "Destroy target tapped creature. You gain 1 life for each creature you control with flying.",
    "Exile target creature or planeswalker that's black or red. Scry 1. ",
    "Put target creature with power 4 or greater on the bottom of its owner's library.",
    "Destroy all nonland permanents.",
    "Return up to three target creatures to their owners' hands.",
    "Look at the top seven cards of your library. Put two of them into your hand and the rest on the bottom of your library in a random order.",
    "Return all nonland permanents to their owners' hands. If you return four or more nontoken permanents you control this way, you may put a permanent card from your hand onto the battlefield.",
    "This spell costs {1} less to cast if you control a creature with flying.\nDraw two cards.",
    "As an additional cost to cast this spell, sacrifice a creature.\nReturn a creature card from your graveyard to the battlefield, then return another creature card from your graveyard to your hand.",
    "As an additional cost to cast this spell, sacrifice a creature.\nDestroy target creature.",
    "Target opponent reveals their hand. You choose a noncreature, nonland card from it. That player discards that card.",
    "Exile target creature an opponent controls with mana value 2 or less and all other creatures that player controls with the same name as that creature. Then that player reveals their hand and exiles all cards with that name from their hand and graveyard.",
    "Target player discards two cards.",
    "Choose two target players. Each of them searches their library for a card, then shuffles and puts that card on top.",
    "Return up to two target creature cards from your graveyard to your hand.",
    "This spell can't be countered.\nTarget opponent reveals their hand. Exile all noncreature, nonland cards from that player's hand and graveyard.",
    "Gain control of target creature until end of turn. Untap that creature. It gains haste until end of turn. ",
    "Destroy target land. Creatures without flying can't block this turn.",
    "Creatures you control get +2/+2 and gain trample until end of turn.",
    "Target creature you control deals damage equal to its power to target creature you don't control.",
    "Destroy target tapped creature.",
    "Return target creature card from your graveyard to your hand.",
    "Target player gains 4 life.\nDraw a card.",
    "Creatures you control get +2/+1 until end of turn.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, those creatures also gain vigilance until end of turn. ",
    "Spell mastery — If there are two or more instant and/or sorcery cards in your graveyard, you may cast Swift Reckoning as though it had flash. \nDestroy target tapped creature.",
    "For each player, you choose from among the permanents that player controls an artifact, a creature, an enchantment, and a planeswalker. Then each player sacrifices all other nonland permanents they control.",
    "Put target creature on top of its owner's library. Scry 1. ",
    "Each player shuffles their hand and graveyard into their library, then draws seven cards. If it's your turn, end the turn. ",
    "Return all nonland permanents with mana value X or less to their owners' hands.",
    "Target player mills X cards, where X is the number of lands you control.",
    "Search your library for a card, put that card into your hand, then shuffle.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, add {B}{B}{B}.",
    "Non-Elf creatures get -2/-2 until end of turn.",
    "Choose a creature card name. Search target opponent's graveyard, hand, and library for any number of cards with that name and exile them. Then that player shuffles.",
    "All creatures get -4/-4 until end of turn.",
    "Return up to two target creature cards from your graveyard to your hand, then discard a card.",
    "Put target creature card from a graveyard onto the battlefield under your control.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, that creature enters with two additional +1/+1 counters on it.",
    "Target opponent reveals their hand. You may choose a nonland card from it. If you do, that player discards that card. If you don't, that player discards two cards.",
    "Scry 2, then draw two cards. You lose 2 life.",
    "Destroy target creature with power 3 or less.",
    "As an additional cost to cast this spell, sacrifice a creature.\nTarget player discards a number of cards equal to the sacrificed creature's power.",
    "Gain control of target creature until end of turn. Untap that creature. It gains haste until end of turn. ",
    "Target creature you control deals damage equal to its power to each other creature and each opponent.",
    "Destroy target artifact or land.",
    "Create two 1/1 red Goblin creature tokens.",
    "As an additional cost to cast this spell, discard a land card.\nDraw two cards.",
    "Reveal the top X cards of your library. Put all land cards from among them onto the battlefield tapped and the rest on the bottom of your library in a random order.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, untap those lands.",
    "Each player shuffles all cards from their hand and all permanents they own into their library, then draws that many cards. Each player may put any number of land cards from their hand onto the battlefield. Exile The Great Aurora.",
    "Each creature you control gets +3/+3 until end of turn and must be blocked this turn if able.",
    "Scry 5, then reveal the top card of your library. If it's a creature card, you draw cards equal to its power and you gain life equal to its toughness.",
    "Target creature you control gets +2/+2 until end of turn. It fights target creature an opponent controls. ",
    "Return up to two target creatures to their owners' hands.",
    "Target player discards two cards.",
    "Each player returns all artifact cards from their graveyard to the battlefield.",
    "Search your library for an Equipment card, reveal that card, put it into your hand, then shuffle.",
    "Search target opponent's library for an artifact card and put that card onto the battlefield under your control. Then that player shuffles.",
    "Draw a card. Scry 2.",
    "Target player discards two cards. Scry 2. ",
    "You draw two cards and you lose 2 life.",
    "Target opponent reveals their hand. You choose an artifact card from it. That player discards that card.",
    "As an additional cost to cast this spell, sacrifice any number of creatures.\nTarget creature gets +2/+2 until end of turn for each creature sacrificed this way.",
    "Destroy each nonland artifact with mana value 4 or less.",
    "Add {R} for each tapped land your opponents control.",
    "Target opponent reveals their hand. You may copy an instant or sorcery card in it. If you do, you may cast the copy without paying its mana cost.",
    "Target creature gets +5/+0 and gains haste until end of turn.",
    "Add {W}{U}{B}{R}{G}.",
    "Choose one —\n• Untap all lands you control.\n• Until end of turn, lands you control become 2/2 creatures that are still lands.\nEntwine {2}{G} ",
    "Create three 1/1 colorless Servo artifact creature tokens.\nYou may cast a spell with mana value 3 or less from your hand without paying its mana cost.",
    "Return up to three target artifacts and/or creatures to their owners' hands.\nYou may cast a spell with mana value 4 or less from your hand without paying its mana cost.",
    "Improvise \nDraw three cards.",
    "Improvise \nTarget creature gets -X/-X until end of turn. You gain X life.",
    "Destroy target creature or Vehicle.",
    "Return target creature card from your graveyard to your hand. If you control an artifact, draw a card.",
    "Exile target nonland card from your graveyard. Search your library for any number of cards with the same name as that card, reveal them, put them into your hand, then shuffle.",
    "All creatures get -3/-3 until end of turn.\nYou may cast a spell with mana value 3 or less from your hand without paying its mana cost.",
    "Choose one —\n• Destroy target artifact.\n• Creatures without flying can't block this turn.",
    "Destroy X target artifacts and/or creatures. For each permanent destroyed this way, its controller reveals cards from the top of their library until an artifact or creature card is revealed and exiles that card. Those players put the exiled cards onto the battlefield, then shuffle.",
    "Gain control of target creature or Vehicle until end of turn. Untap it. It gains haste until end of turn.\nYou may cast a spell with mana value 2 or less from your hand without paying its mana cost.",
    "Destroy X target artifacts. Create X 2/2 red Gremlin creature tokens.",
    "Gain control of target creature with power 4 or less until end of turn. Untap that creature. It gains haste until end of turn.",
    "Target creature you control fights target creature you don't control. ",
    "Draw cards equal to the greatest power among creatures you control.\nYou may cast a spell with mana value 5 or less from your hand without paying its mana cost.",
    "Put a +1/+1 counter on each creature you control.",
    "Destroy target creature. You may search your library and/or graveyard for a card named Tezzeret, Master of Metal, reveal it, and put it into your hand. If you search your library this way, shuffle.",
    "Players play a Magic subgame, using their libraries as their decks. Each player who doesn't win the subgame loses half their life, rounded up.",
    "Destroy target permanent.",
    "As an additional cost to cast this spell, sacrifice a creature.\nAdd X mana of any one color, where X is 1 plus the sacrificed creature's mana value. Spend this mana only to cast creature spells.",
    "Put any number of target artifact cards from target player's graveyard on top of their library in any order.",
    "Return target artifact card from your graveyard to your hand.",
    "Destroy target artifact with mana value X. It can't be regenerated. Detonate deals X damage to that artifact's controller.",
    "Destroy all artifacts. They can't be regenerated.",
    "Destroy all black creatures.",
    "Look at the top five cards of target player's library. You may then have that player shuffle that library.",
    "Destroy all Forests.",
    "You and target player exchange control of the creature you each control with the highest mana value. Then exchange control of artifacts the same way. If two or more permanents a player controls are tied for highest, their controller chooses one of them.",
    "X target creatures gain islandwalk until end of turn. ",
    "Discard X cards, then return a card from your graveyard to your hand for each card discarded this way. Exile Recall.",
    "Each player shuffles the cards from their hand into their library, then draws that many cards.",
    "Starting with you, each player may put a permanent card from their hand onto the battlefield. Repeat this process until no one puts a card onto the battlefield.",
    "Search your library for a basic land card, put that card onto the battlefield, then shuffle.",
    "For each land, destroy that land unless any player pays 1 life.",
    "Exile two target artifacts.",
    "Exile all white creatures. For each creature exiled this way, its controller draws a card.",
    "Destroy all Goblins.",
    "Target player reveals their hand and discards all nonland cards.",
    "Tap X target creatures.",
    "Create four 1/1 white Citizen creature tokens.",
    "Target player discards two cards at random.",
    "Target player discards two cards at random.",
    "As an additional cost to cast this spell, exile a creature you control.\nReturn target creature card from your graveyard to the battlefield. Put a +2/+2 counter on that creature if the exiled creature was a Thrull.",
    "Look at the top three cards of target player's library, then put them back in any order. You may have that player shuffle.\nDraw a card at the beginning of the next turn's upkeep.",
    "Until end of turn, whenever a creature you control attacks and isn't blocked, you may choose to have it deal damage equal to its power to a target creature. If you do, it assigns no combat damage this turn.",
    "Target player discards a card.\nDraw a card at the beginning of the next turn's upkeep.",
    "Look at target player's hand and choose X cards from it. That player discards those cards.",
    "Each player loses a third of their life, then discards a third of the cards in their hand, then sacrifices a third of the creatures they control, then sacrifices a third of the lands they control. Round up each time.",
    "X is the number of artifact and/or creature cards in an opponent's graveyard as you cast this spell.\nDistribute X +1/+1 counters among any number of target creatures.",
    "Destroy all white permanents.",
    "Destroy X target snow lands.",
    "Flip a coin. If you win the flip, you gain 1 life and target opponent loses 1 life, and you decide whether to flip again. If you lose the flip, you lose 1 life and that opponent gains 1 life, and that player decides whether to flip again. Double the life stakes with each flip.",
    "Destroy all artifacts, creatures, and lands. They can't be regenerated.",
    "Destroy target land.",
    "Destroy all enchantments or all nonwhite enchantments.",
    "Search your library for a Forest card, put that card onto the battlefield, then shuffle.",
    "Target player chooses three cards from their hand and puts them on top of their library in any order.",
    "Destroy target land. If that land was a snow land, you gain 1 life.",
    "As an additional cost to cast this spell, sacrifice a creature.\nSearch your library for a creature card, reveal it, put it into your hand, then shuffle.",
    "Look at the top five cards of your library. Put one of them into your hand and the rest on top of your library in any order.",
    "As an additional cost to cast this spell, pay 3 life.\nDestroy target creature and target land.",
    "Put target creature card from a graveyard onto the battlefield under your control.",
    "Reveal the top card of target opponent's library. If it's a land, you gain 1 life. Then that player shuffles.\nDraw a card at the beginning of the next turn's upkeep.",
    "Target player discards two cards, then draws as many cards as they discarded this way.",
    "Search your library for a blue instant card, reveal that card, put it into your hand, then shuffle.",
    "Choose two target creatures controlled by the same opponent. That player chooses and sacrifices one of those creatures. Put a -1/-1 counter on the other.",
    "You gain X plus 1 life, where X is the number of green creatures on the battlefield.",
    "As an additional cost to cast this spell, sacrifice a land.\nSearch your library for a basic land card, put that card onto the battlefield, then shuffle.\nDraw a card at the beginning of the next turn's upkeep.",
    "Each player shuffles their hand and graveyard into their library. You exile the top ten cards of your library. Then each player draws up to seven cards.",
    "Search your library for three cards, exile them, then shuffle.\nDraw a card at the beginning of the next turn's upkeep.",
    "An opponent chooses one —\n• You draw three cards at the beginning of the next turn's upkeep.\n• You search your library for a card, put that card into your hand, then shuffle.",
    "An opponent chooses one —\n• You draw three cards.\n• You destroy up to two target creatures that player controls. They can't be regenerated. That player draws up to three cards.",
    "As an additional cost to cast this spell, sacrifice a creature.\nGain control of target nonartifact, nonblack creature.",
    "Destroy target artifact or land. It can't be regenerated.",
    "As an additional cost to cast this spell, you may pay {1}{R} and/or {1}{G} any number of times.\nDestroy target artifact. For each additional {1}{R} you paid, destroy another target artifact. For each additional {1}{G} you paid, destroy another target artifact, and you gain 1 life.",
    "As an additional cost to cast this spell, you may pay {1}{G} any number of times.\nYou gain 3 life plus an additional 3 life for each additional {1}{G} you paid.",
    "An opponent chooses one —\n• You put a +1/+1 counter on each creature you control and gain 4 life.\n• You put a -1/-1 counter on each creature that player controls and Misfortune deals 4 damage to that player.",
    "Tap all nonwhite creatures.",
    "Look at the top seven cards of your library. Put two of them into your hand and the rest into your graveyard.",
    "Draw three cards, then put two cards from your hand both on top of your library or both on the bottom of your library.",
    "Exchange control of target land you control and target land an opponent controls. ",
    "Destroy target creature. It can't be regenerated. Its controller reveals cards from the top of their library until they reveal a creature card. The player puts that card onto the battlefield, then shuffles all other cards revealed this way into their library.",
    "If the difference between your life total and target player's life total is 5 or less, exchange life totals with that player.",
    "Put target creature card from an opponent's graveyard onto the battlefield under your control.",
    "Draw four cards. You lose half your life, rounded up.",
    "Look at target opponent's hand and choose a card from it. Put that card on top of that player's library.",
    "As an additional cost to cast this spell, sacrifice two creatures.\nDestroy target artifact.",
    "Destroy all green creatures or all white creatures. They can't be regenerated. You lose 2 life for each creature that died this way.",
    "Target opponent discards a card at random, then discards a card.",
    "Create three 1/1 red Goblin Scout creature tokens with mountainwalk. ",
    "Each player may bid life for control of target creature. You start the bidding with a bid of 0. In turn order, each player may top the high bid. The bidding ends if the high bid stands. The high bidder loses life equal to the high bid and gains control of the creature. ",
    "Choose one —\n• Destroy target Plains and target white creature.\n• Destroy target Island and target blue creature.",
    "Destroy target land.",
    "Put target land on top of its owner's library.",
    "Search your library for a basic land card, put that card onto the battlefield tapped, then shuffle.",
    "Destroy all artifacts. They can't be regenerated. The controller of each of those artifacts gains life equal to its mana value.",
    "Each player creates a 1/1 green Cat creature token for each untapped Forest they control.",
    "This spell costs 3 life more to cast for each target.\nDestroy any number of target creatures.",
    "Look at the top X cards of target opponent's library. Exile one of those cards and put the rest back on top of that player's library in any order.",
    "This turn and next turn, creatures can't attack, and players and permanents can't be the targets of spells or activated abilities.",
    "Destroy all creatures with power 4 or greater. They can't be regenerated.",
    "Each player draws X cards.",
    "Return two target creatures to their owners' hands.",
    "Target opponent reveals their hand. You choose a card from it. That player discards that card.",
    "Sacrifice a nontoken permanent. If you do, target opponent loses 2 life unless that player sacrifices a permanent or discards a card. You may repeat this process any number of times.",
    "Untap all creatures that attacked this turn. After this main phase, there is an additional combat phase followed by an additional main phase.",
    "Mill four cards. Whenever a creature attacks this turn, it gets +1/+0 until end of turn for each creature card put into your graveyard this way.",
    "Destroy target artifact, enchantment, or land.",
    "Return target card from your graveyard to your hand.",
    "As an additional cost to cast this spell, sacrifice a green creature.\nSearch your library for a green creature card, put it onto the battlefield, then shuffle.",
    "You may play up to three additional lands this turn.",
    "You gain 2 life for each card in your hand.",
    "Each player sacrifices the creature they control with the highest mana value unless they pay that creature's mana cost. If two or more creatures a player controls are tied for highest, that player chooses one.",
    "Return target artifact card from your graveyard to the battlefield.",
    "Each player discards any number of cards, then draws that many cards.\nDraw a card.",
    "Exile all cards from your library. Then shuffle your graveyard into your library.",
    "Return target instant or sorcery card from your graveyard to your hand.",
    "Look at target player's hand and choose two cards from it. Put them on top of that player's library in any order.",
    "Search your library for up to three creature cards, put them into your graveyard, then shuffle.",
    "Search your library and graveyard for five cards and exile the rest. Put the chosen cards on top of your library in any order. You lose half your life, rounded up.",
    "Return X target creature cards from your graveyard to your hand. You lose X life.",
    "As an additional cost to cast this spell, sacrifice a creature.\nTarget opponent discards two cards.",
    "Target creature gets +3/+3 and gains first strike until end of turn.",
    "Each player draws a card for each creature card in their graveyard.",
    "Target creature deals damage to itself equal to its power.",
    "Destroy all creatures that aren't enchanted. They can't be regenerated.",
    "Draw three cards, then put two cards from your hand both on top of your library or both on the bottom of your library.",
    "Exchange control of target artifact or creature and another target permanent that shares one of those types with it. ",
    "Search your library for any number of land cards, exile them, then shuffle.",
    "Put target creature on top of its owner's library.",
    "Target player takes an extra turn after this one.",
    "As an additional cost to cast this spell, discard X cards.\nLook at target opponent's hand and choose X cards from it. That player discards those cards.",
    "Target opponent reveals their hand. You choose a card from it. That player discards that card.",
    "Buyback {3} \nReturn target creature card from your graveyard to your hand.",
    "Destroy X target nonblack creatures. Draw X cards.",
    "Destroy all creatures of the creature type of your choice.",
    "Each player exiles all creature cards from their graveyard, then sacrifices all creatures they control, then puts all cards they exiled this way onto the battlefield.",
    "Destroy all green creatures. They can't be regenerated.",
    "Destroy target land.",
    "Put target creature card from a graveyard onto the battlefield under your control. You lose life equal to its mana value.",
    "Destroy target artifact, creature, or land. Aftershock deals 3 damage to you.",
    "Exile all permanents. You discard your hand.",
    "Tap target creature. It deals damage equal to its power to another target creature.",
    "Rolling Thunder deals X damage divided as you choose among any number of targets.",
    "As an additional cost to cast this spell, discard X land cards.\nDestroy X target lands.",
    "Destroy target land.",
    "Target player gains 8 life.",
    "Creatures you control get +3/+3 and gain trample until end of turn.",
    "Search your library for a basic land card, put that card onto the battlefield tapped, then shuffle.",
    "Destroy all enchantments.",
    "Destroy target land.",
    "Target player reveals their hand, then you choose a card other than a basic land card from it. Search that player's graveyard, hand, and library for all cards with the same name as the chosen card and exile them. Then that player shuffles.",
    "Look at the top five cards of target player's library. Put any number of them on the bottom of that library in any order and the rest on top of the library in any order.",
    "Draw three cards, then discard a card.",
    "Tap up to three target creatures without flying.",
    "Buyback {2}{B}{B} \nTarget opponent loses 2 life. You gain 2 life.",
    "Choose two target creatures controlled by the same player. Exile one of those creatures and put two +1/+1 counters on the other.",
    "Destroy target tapped creature.",
    "Buyback {4} \nCreate a 1/1 black Rat creature token.",
    "Buyback {2}{B}{B} \nTarget player discards a card.",
    "Destroy all creatures target player controls. For each creature that died this way, that player creates two 1/1 red Goblin creature tokens.",
    "Destroy all nonbasic lands.",
    "Buyback {3} \nTarget creature gets +3/+0 until end of turn.",
    "Distribute two +1/+1 counters among one or two target creatures.",
    "Reveal the top four cards of your library. Put all land cards revealed this way into your hand and the rest into your graveyard.",
    "Buyback {3} \nTarget land becomes a 2/2 creature that's still a land. ",
    "Target creature gets +3/+3 and gains flying until end of turn. ",
    "Each player chooses from among the permanents they control an artifact, a creature, an enchantment, and a land, then sacrifices the rest.",
    "Buyback—Sacrifice a land. \nCreate a 1/1 white Pegasus creature token with flying.",
    "As an additional cost to cast this spell, discard X creature cards.\nReturn X target creatures to their owners' hands.",
    "For each creature, its controller sacrifices a permanent unless they pay {1}.",
    "Draw a card for each tapped creature target opponent controls.",
    "Return two target creature cards from your graveyard to your hand.",
    "Target player discards three cards.",
    "All creatures get -1/-1 until end of turn.",
    "Buyback—Pay 3 life, Discard a card at random. \nDestroy target land.",
    "Destroy all lands or all creatures. Creatures destroyed this way can't be regenerated.",
    "Destroy target creature. Its owner gains 4 life.",
    "Return all basic land cards from all graveyards to the battlefield tapped under their owners' control.",
    "Creatures and lands target opponent controls don't untap during their next untap step.",
    "Each player may put an artifact, creature, enchantment, or land card from their hand onto the battlefield.",
    "Each player discards their hand, then draws cards equal to the greatest number of cards a player discarded this way.",
    "Destroy target land or nonblack creature. It can't be regenerated.",
    "Corrupt deals damage to any target equal to the number of Swamps you control. You gain life equal to the damage dealt this way.",
    "Target opponent reveals their hand. You choose a noncreature, nonland card from it. That player discards that card.",
    "Each player puts a creature card from their graveyard onto the battlefield.",
    "Choose a color. Target player reveals their hand and discards all cards of that color.",
    "Sacrifice any number of artifacts, creatures, and/or lands. Draw a card for each permanent sacrificed this way.",
    "Each opponent discards two cards.",
    "Choose two target creature cards in your graveyard. Sacrifice a creature. If you do, return the chosen cards to the battlefield tapped.",
    "Until end of turn, you may play lands and cast spells from your graveyard.\nIf a card would be put into your graveyard from anywhere this turn, exile that card instead.",
    "Search your library for a card, put that card into your hand, discard a card at random, then shuffle.",
    "Create X 1/1 red Goblin creature tokens.",
    "Destroy target land.\nCycling {2} ",
    "Destroy each artifact with mana value X or less.",
    "Destroy two target lands.",
    "As an additional cost to cast this spell, sacrifice a land.\nDestroy target land.",
    "Search your library for up to two Forest cards, reveal those cards, put them into your hand, then shuffle.",
    "Destroy all enchantments.\nCycling {2} ",
    "You gain 6 life.\nCycling {2} ",
    "Put a +1/+1 counter on each creature you control.",
    "Destroy all creatures with flying.",
    "Destroy all artifacts and enchantments.",
    "As an additional cost to cast this spell, sacrifice an artifact.\nSearch your library for an artifact card, put that card onto the battlefield, then shuffle.",
    "Target opponent reveals their hand. You choose a creature card from it. That player discards that card.",
    "Return target creature card with mana value 3 or less from your graveyard to the battlefield.\nCycling {2} ",
    "Destroy target creature with flying.",
    "Exile target nontoken permanent, then return it to the battlefield under its owner's control.",
    "Return all enchantment cards from your graveyard to the battlefield. ",
    "Target player gains control of target permanent you control.",
    "Target player skips their next draw step.",
    "Until end of turn, whenever a player taps a Swamp for mana, that player adds an additional {B}.",
    "Target player reveals their hand. You choose a nonbasic land card from it. That player discards that card.",
    "Exile target nonblack creature. Search its controller's graveyard, hand, and library for all cards with the same name as that creature and exile them. Then that player shuffles.",
    "Target player loses 4 life and you gain 4 life.",
    "Exile target nonbasic land. Search its controller's graveyard, hand, and library for all cards with the same name as that land and exile them. Then that player shuffles.",
    "Destroy target land and all other lands with the same name as that land.",
    "Destroy all enchantments. You gain 2 life for each enchantment destroyed this way.",
    "Put two target lands on top of their owners' libraries.",
    "Reveal any number of green cards in your hand. Return an enchantment card from your graveyard to your hand for each card revealed this way.",
    "Exile target artifact. Search its controller's graveyard, hand, and library for all cards with the same name as that artifact and exile them. Then that player shuffles.",
    "Kicker {2}{W} \nChoose target creature with mana value 3 or less. If this spell was kicked, instead choose target creature. Exile the chosen creature, then its controller gains life equal to its mana value.",
    "This spell costs {1} less to cast for each card you've drawn this turn.\nThe owner of target nonland permanent puts it into their library second from the top or on the bottom.",
    "Choose one —\n• Target player creates a 2/2 black Zombie creature token.\n• Return target creature card from your graveyard to your hand.\nEntwine {2} ",
    "As an additional cost to cast this spell, sacrifice a creature or sacrifice a modified creature. \nDestroy target creature or planeswalker. If the modified creature was sacrificed, draw a card.",
    "Devoid \nFanged Flames deals 4 damage to target creature or planeswalker. If that creature or planeswalker would die this turn, exile it instead.",
    "Put a +1/+1 counter on target creature you control, then double the number of +1/+1 counters on each creature that had a +1/+1 counter put on it this way.\nOverload {4}{G}{G} ",
    "You may sacrifice a nontoken green creature rather than pay this spell's mana cost.\nSearch your library for up to two basic land cards, reveal those cards, put one onto the battlefield tapped and the other into your hand, then shuffle.",
    "Target creature you control deals damage equal to its power to target creature or planeswalker you don't control. If you control an Eldrazi, you gain 3 life.",
    "Destroy target land. Its controller may search their library for a basic land card, put it onto the battlefield tapped, then shuffle. Creatures without flying can't block this turn.",
    "Target creature you control gets +2/+2 until end of turn. It fights up to one target creature you don't control. ",
    "This spell costs {1} less to cast for each 1 life your opponents have lost this turn.\nTarget opponent exiles the top three cards of their library. Until the end of your next turn, you may play those cards. If you cast a spell this way, mana of any type can be spent to cast it.",
    "Target creature you control deals damage equal to its power to target creature or planeswalker you don't control.",
    "Create X 4/4 white Angel creature tokens with flying.\nCycling {2}{W} \nWhen you cycle Decree of Justice, you may pay {X}. If you do, create X 1/1 white Soldier creature tokens.",
    "Return target permanent card with mana value 3 or less from your graveyard to the battlefield. If this spell was cast from a graveyard, you may copy this spell and may choose a new target for the copy.\nFlashback {4}{W} ",
    "Target player draws two cards.\nFlashback—{1}{U}, Pay 3 life. ",
    "Search your library for up to three creature cards, put them into your graveyard, then shuffle.",
    "As an additional cost to cast this spell, pay X life.\nAll creatures get -X/-X until end of turn.",
    "Choose two target creature cards in your graveyard. Sacrifice a creature. If you do, return the chosen cards to the battlefield tapped.",
    "Destroy each artifact with mana value X or less.",
    "You may sacrifice a nontoken green creature rather than pay this spell's mana cost.\nSearch your library for up to two basic land cards, reveal those cards, put one onto the battlefield tapped and the other into your hand, then shuffle.",
    "As an additional cost to cast this spell, pay X life.\nAll creatures get -X/-X until end of turn.",
    "Choose two target creature cards in your graveyard. Sacrifice a creature. If you do, return the chosen cards to the battlefield tapped.",
    "Destroy each artifact with mana value X or less.",
    "You may sacrifice a nontoken green creature rather than pay this spell's mana cost.\nSearch your library for up to two basic land cards, reveal those cards, put one onto the battlefield tapped and the other into your hand, then shuffle.",
    "Return target creature card from your graveyard to the battlefield. Create a Food token. ",
    "Converge — Exile target nonland permanent if its mana value is less than or equal to the number of colors of mana spent to cast this spell.",
    "Suspend 2— {1}{W} \nReturn all enchantment cards from your graveyard to the battlefield. ",
    "Exile target creature card from your graveyard. Create X 1/1 white Bird creature tokens with flying, where X is the exiled card's toughness.",
    "Create a 0/3 blue Crab creature token.\nInvestigate. ",
    "Suspend 3— {1}{U}{U} \nSearch target opponent's library for a creature card and put that card onto the battlefield under your control. Then that player shuffles.",
    "Draw X cards, where X is the number of card types among cards in your graveyard.",
    "Target noncreature artifact you control becomes a 0/0 artifact creature. Put four +1/+1 counters on each artifact that became a creature this way.\nOverload {4}{U}{U} ",
    "Return target instant or sorcery card from your graveyard to your hand.",
    "Return two target creatures to their owners' hands.\nWizardcycling {2} ",
    "Converge — Create a 1/1 colorless Thopter artifact creature token with flying for each color of mana spent to cast this spell.",
    "As an additional cost to cast this spell, sacrifice a creature or discard a card.\nDestroy target creature or planeswalker.",
    "Destroy target creature. A creature destroyed this way can't be regenerated.\nOverload {2}{W}{W} ",
    "Look at the top four cards of your library. Put one of them into your hand and the rest into your graveyard. You gain life equal to the greatest power among creature cards put into your graveyard this way.",
    "Return target creature card and all other cards with the same name as that card from your graveyard to your hand.",
    "Exile target creature or planeswalker. You gain life equal to the number of counters on it.",
    "Return target nonlegendary creature card from your graveyard to the battlefield with a -1/-1 counter on it.",
    "Suspend 2— {1}{B} \nSearch your library for a card, put that card into your hand, then shuffle.",
    "Target opponent reveals their hand. You choose a card from it. That player discards that card, then discards a card at random.",
    "Search your library for a nonlegendary card, put that card into your graveyard, then shuffle.",
    "Exile the top card of your library. During your next turn, you may play that card.\nStorm ",
    "Gain control of target creature you don't control until end of turn. Untap that creature. It gains haste until end of turn.\nStorm ",
    "Create a Treasure token. \nFlashback {2}{R} ",
    "Choose land or nonland. Reveal cards from the top of your library until you reveal a card of the chosen kind. Put that card into your hand and the rest on the bottom of your library in a random order.",
    "Create a 1/1 green Squirrel creature token.\nStorm ",
    "Destroy target artifact or enchantment. Create a Treasure token. ",
    "Suspend 4— {G}\nUntil end of turn, you may play lands and cast spells from your graveyard.\nIf a card would be put into your graveyard from anywhere this turn, exile that card instead.",
    "Proliferate. \nTarget creature you control fights up to one target creature you don't control.",
    "Search your library for a basic land card, put it onto the battlefield, then shuffle.\nRebound ",
    "Choose one —\n• Return target creature card from your graveyard to the battlefield with an additional +1/+1 counter on it.\n• Return up to two target creature cards with power 2 or less from your graveyard to the battlefield.",
    "Aftermath \nRuin deals damage to target creature equal to the number of lands you control.",
    "Destroy target creature.\nMadness {B}{R} ",
    "Return all permanents to their owners' hands.",
    "Each player chooses a creature type. Each player returns all creature cards of a type chosen this way from their graveyard to the battlefield.",
    "Destroy target permanent.",
    "Return target creature card from your graveyard to the battlefield. Create a Food token. ",
    "Target noncreature artifact you control becomes a 0/0 artifact creature. Put four +1/+1 counters on each artifact that became a creature this way.\nOverload {4}{U}{U} ",
    "Return target nonlegendary creature card from your graveyard to the battlefield with a -1/-1 counter on it.",
    "Choose land or nonland. Reveal cards from the top of your library until you reveal a card of the chosen kind. Put that card into your hand and the rest on the bottom of your library in a random order.",
    "Aftermath \nRuin deals damage to target creature equal to the number of lands you control.",
    "Converge — Exile target nonland permanent if its mana value is less than or equal to the number of colors of mana spent to cast this spell.",
    "Suspend 2— {1}{W} \nReturn all enchantment cards from your graveyard to the battlefield. ",
    "Suspend 3— {1}{U}{U} \nSearch target opponent's library for a creature card and put that card onto the battlefield under your control. Then that player shuffles.",
    "Return two target creatures to their owners' hands.\nWizardcycling {2} ",
    "As an additional cost to cast this spell, sacrifice a creature or discard a card.\nDestroy target creature or planeswalker.",
    "Destroy target creature. A creature destroyed this way can't be regenerated.\nOverload {2}{W}{W} ",
    "Return target nonlegendary creature card from your graveyard to the battlefield with a -1/-1 counter on it.",
    "Suspend 2— {1}{B} \nSearch your library for a card, put that card into your hand, then shuffle.",
    "Exile the top card of your library. During your next turn, you may play that card.\nStorm ",
    "Create a 1/1 green Squirrel creature token.\nStorm ",
    "Suspend 4— {G}\nUntil end of turn, you may play lands and cast spells from your graveyard.\nIf a card would be put into your graveyard from anywhere this turn, exile that card instead.",
    "Destroy target creature.\nMadness {B}{R} ",
    "Suspend 2— {1}{W} \nReturn all enchantment cards from your graveyard to the battlefield. ",
    "Suspend 3— {1}{U}{U} \nSearch target opponent's library for a creature card and put that card onto the battlefield under your control. Then that player shuffles.",
    "Destroy target creature. A creature destroyed this way can't be regenerated.\nOverload {2}{W}{W} ",
    "Suspend 2— {1}{B} \nSearch your library for a card, put that card into your hand, then shuffle.",
    "Search your library for a nonlegendary card, put that card into your graveyard, then shuffle.",
    "Suspend 4— {G}\nUntil end of turn, you may play lands and cast spells from your graveyard.\nIf a card would be put into your graveyard from anywhere this turn, exile that card instead.",
    "Create two 1/1 white Bird creature tokens with flying.\nFlashback—Tap three untapped white creatures you control. ",
    "Choose one or both —\n• Exile target creature you don't control.\n• Exile target creature you control, then return it to the battlefield under its owner's control.",
    "Create a 3/3 colorless Phyrexian Golem artifact creature token.\nSplice onto instant or sorcery {3}{W} ",
    "Exile target creature you don't control. For each creature exiled this way, its controller searches their library for a basic land card. Those players put those cards onto the battlefield tapped, then shuffle.\nOverload {4}{W}{W} ",
    "Each player shuffles their hand and graveyard into their library, then draws seven cards.\nFlashback {2}{U} ",
    "Scry 2, then draw a card.\nFlashback {4}{U} ",
    "Target player mills four cards. You shuffle up to four cards from your graveyard into your library.\nReplicate {2}{U}{U} ",
    "All nonsnow creatures get -X/-X until end of turn, where X is the number of snow permanents you control.",
    "Target player discards two cards.\nOverload {1}{B} ",
    "Look at the top three cards of your library. Put one of them into your hand and the rest into your graveyard.",
    "Choose one —\n• Return target creature card from your graveyard to your hand.\n• Return two target creature cards that share a creature type from your graveyard to your hand.",
    "Choose one —\n• Target opponent reveals their hand and discards all colorless nonland cards.\n• Target opponent reveals their hand and discards all multicolored cards.",
    "Return target creature card with mana value 3 or less from your graveyard to the battlefield.\nCycling {2} ",
    "Destroy target land. Its controller may search their library for a basic land card, put it onto the battlefield, then shuffle.\nDraw a card.",
    "Gain control of target creature until end of turn. Untap that creature. It gains haste until end of turn. If that creature is a Goat, it also gets +3/+0 until end of turn.",
    "Choose one —\n• Create three 1/1 red Goblin creature tokens.\n• Creatures you control get +1/+1 and gain haste until end of turn.\nEntwine {2}{R} ",
    "Destroy target artifact or land. It can't be regenerated.",
    "Pyrophobia deals 3 damage to target creature. Cowards can't block this turn.",
    "Target creature gets +3/+0 and gains haste until end of turn.\nFlashback {2}{R} ",
    "Destroy target artifact.\nDredge 1 ",
    "Cascade \nRetrace ",
    "Suspend 4— {G} \nCreate two 4/4 green Rhino creature tokens with trample.",
    "Reveal the top six cards of your library. You may put any number of snow permanent cards from among them into your hand. Put the rest into your graveyard.",
    "Return target card from your graveyard to your hand.",
    "Target creature you control gets +2/+2 until end of turn if its power is 2. Then it fights target creature you don't control. ",
    "Until end of turn, target creature you control becomes a green Wurm with base power and toughness 6/4.\nOverload {4}{G}{G} ",
    "Create a 3/3 green Elephant creature token.\nRebound ",
    "Choose creature or land. Reveal the top four cards of your library. Put all cards of the chosen type revealed this way into your hand and the rest into your graveyard.",
    "Exile the top six cards of your library. You may cast up to two sorcery spells with mana value 3 or less from among them without paying their mana costs. Put the exiled cards not cast this way on the bottom of your library in a random order."
]